<?php
// Heading
$_['heading_title'] = '<strong style="color:#41637d">DEV-OPENCART.COM —</strong> Universal Import/Export Pro 3.7.1 <a href="https://dev-opencart.com" target="_blank" title="Dev-opencart.com - Модули и шаблоны для Opencart"><img style="margin-left:15px;height:35px;margin-top:10px;margin-bottom:10px;" src="https://dev-opencart.com/logob.svg" alt="Dev-opencart.com - Модули и шаблоны для Opencart"/></a>';

// Text 
$_['text_module'] = 'Модули';
$_['text_browse'] = 'Обзор';
$_['text_continue'] = 'Следующий шаг';
$_['text_add_sub'] = 'Добавить';
$_['text_add_cat'] = 'Добавить категорию';
$_['text_add_subcat'] = 'Добавить подкатегорию';
$_['text_add_column'] = 'Добавить столбец';
$_['text_remove_column'] = 'Удалить столбец';
$_['not_found'] = 'Не найден';
$_['новый'] = 'новый';
$_['text_add_condition'] = 'Добавить условие';

$_['text_success'] = 'Успешно: вы изменили настройки!';
$_['text_store_select'] = 'Магазин:';
$_['text_import'] = 'импорт';
$_['text_source_upload'] = 'ЗАГРУЗКА ФАЙЛА – загрузите свой файл сюда';
$_['text_source_ftp'] = 'FTP — получить файл с удаленного FTP или SFTP-сервера';
$_['text_source_url'] = 'URL – получить файл из URL или Dropbox, Google Drive и т. д.';
$_['text_source_api'] = 'API — подключение к удаленному API';
$_['text_source_path'] = 'ЛОКАЛЬНЫЙ ПУТЬ — установите путь к файлу на вашем сервере';
$_['text_type_product'] = 'Продукт';
$_['text_type_product_update'] = 'Быстрое обновление продукта';
$_['text_type_order'] = 'Заказ';
$_['text_type_order_status_update'] = 'Обновление статуса заказа';
$_['text_type_review'] = 'Отзыв';
$_['text_type_category'] = 'Категория';
$_['text_type_information'] = 'Информация';
$_['text_type_manufacturer'] = 'Производитель';
$_['text_type_customer'] = 'Клиент';
$_['text_subtype_order_info'] = 'Информация о заказе';
$_['text_subtype_order_item'] = 'Товар заказа';
$_['text_type_attribute'] = 'Атрибут';
$_['text_type_filter'] = 'Фильтр';
$_['text_type_restore'] = 'Восстановить резервную копию';
$_['text_type_backup'] = 'Резервное копирование базы данных';
$_['text_product'] = 'Продукты';
$_['text_category'] = 'Категории';
$_['text_information'] = 'Информация';
$_['text_manufacturer'] = 'Производители';
$_['text_review'] = 'Отзыв';
$_['text_customer'] = 'Клиенты';
$_['text_customer_group'] = 'Группа клиентов';
$_['text_order'] = 'Заказы';
$_['text_order_status'] = 'Статусы заказов';
$_['text_ignore'] = '';
$_['text_column'] = 'столбец';
$_['text_next_step'] = 'Подтвердить и продолжить';
$_['text_start_process'] = 'Начать обработку импорта';
$_['text_pausing_process'] = 'Приостановка, подождите, пока не завершится последний пакет...';
$_['text_resume_process'] = 'Возобновить процесс';
$_['text_start_simu_process'] = 'Начать полную симуляцию';
$_['text_pause_process'] = 'Импорт выполняется. Нажмите, чтобы приостановить';
$_['text_pause_simu_process'] = 'Имитация выполняется. Нажмите, чтобы приостановить';
$_['text_previous_step'] = 'Предыдущий шаг';
$_['text_data_preview'] = 'Предварительный просмотр данных';
$_['text_row'] = 'Строка';
$_['text_row_xml'] = 'Элемент';
$_['text_status'] = 'Статус';
$_['text_message'] = 'Сообщение';
$_['text_howto'] = 'Как использовать';

$_['text_action_update'] = 'Обновить - заменить';
$_['text_action_soft_update'] = 'Обновить - сохранить';
$_['text_action_insert'] = 'Вставить';
$_['text_action_skip'] = 'Пропустить';
$_['text_action_option'] = 'Добавить опцию';
$_['text_action_update_option'] = 'Сначала обновите, затем добавьте опцию';
$_['text_action_delete'] = 'Удалить';
$_['text_action_overwrite'] = 'Перезаписать';
$_['text_action_rename'] = 'Переименовать';
$_['text_img_action_keep'] = 'Сохранить фактическое изображение';
$_['text_img_action_rename'] = 'Переименовать новое изображение';
$_['text_img_action_overwrite'] = 'Заменить новым изображением';
$_['text_img_action_continue'] = 'Показать предупреждение и продолжить импорт';
$_['text_img_action_skip'] = 'Пропустить импорт текущего элемента';

// Tabs
$_['text_tab_0'] = 'Импортировать';

$_['text_import_step1'] = '<b>Шаг 1</b> — Выбор файла';
$_['text_import_step2'] = '<b>Шаг 2</b>. Импорт настроек';
$_['text_import_step3'] = '<b>Шаг 3</b>. Сопоставление столбцов';
$_['text_import_step4'] = '<b>Шаг 4</b> – Проверка данных';
$_['text_import_step5'] = '<b>Шаг 5</b>. Запуск процесса';

// Profile manager
$_['text_profile_dir_not_writable'] = 'Папка профиля недоступна для записи, убедитесь, что у вас есть права на запись в папке (и подпапках):';
$_['text_profile_name'] = 'Имя профиля';
$_['text_new_profile'] = '- Сохранить как новый профиль -';
$_['text_save_profile'] = 'Сохранить профиль';
$_['text_delete_profile'] = 'Удалить профиль';
$_['text_really_delete'] = 'Вы уверены, что хотите удалить этот профиль?';
$_['text_save_profile_i'] = 'Сохраните текущий набор настроек, чтобы использовать его при дальнейшем импорте.<br/>Вы можете выбрать существующий профиль, чтобы перезаписать его или создать новый.';
$_['text_profile_saved'] = 'Ваш профиль был правильно сохранен';

// Step 1
$_['entry_name'] = 'Имя';
$_['entry_demo_file'] = 'Загрузить демонстрационный файл';
$_['entry_demo_file_i'] = 'Используйте предварительно загруженные файлы для проверки поведения модуля. Если вы хотите загрузить свой собственный, оставьте это поле пустым и загрузите файл в предыдущее поле.';
$_['entry_type'] = 'Тип импорта';
$_['entry_update_type'] = 'Тип обновления';
$_['entry_subtype'] = 'Импортировать подтип';
$_['entry_type_i'] = 'Какие данные вы собираетесь импортировать?';
$_['entry_profile'] = 'Профиль настроек';
$_['text_select_profile'] = 'Выберите профиль настроек';
$_['entry_profile_i'] = 'Профиль содержит все настройки, которые вы можете установить на шагах 2 и 3. Вы можете сохранить новый профиль на шаге 4';
$_['entry_profile_export_i'] = 'Профиль содержит все установленные вами настройки. Сохраните профиль для облегчения загрузки ваших параметров.';
$_['entry_file'] = 'Выберите источник файла';
$_['entry_file_i'] = 'Выберите здесь свой файл.<br/>Поддерживается неограниченный размер.<br/>Совместимые форматы: CSV, XML, XLS, XLSX, JSON, ODS';
$_['source_ftp'] = 'FTP-соединение';
$_['source_ftp_i'] = 'Подключитесь к FTP, чтобы получить файл, не забудьте начальный ftp://';
$_['source_ftp_path'] = 'Путь к FTP-файлу';
$_['source_url'] = 'Ссылка на файл';
$_['source_url_i'] = 'Получите файл по внешнему URL-адресу. Если файл защищен паролем, установите URL-адрес следующим образом http://user:password@website.tld/...';
$_['source_api_url'] = 'API';
$_['source_api_url_i'] = 'Вставьте сюда URL-адрес вашего API, как описано в документации по API';
$_['source_api_auth'] = 'Логин или ключ API';
$_['source_api_auth_i'] = 'Вставьте логин для аутентификации в свой API. Если пользователь и пароль вставляют их через двоеточие (пользователь:пароль), если ваш API работает только с ключом API или токеном, просто вставьте его сюда, вы можете также используйте HEAD| для установки определенного заголовка или POST|key:val GET|key:val для установки определенных параметров';
$_['source_api_auth_url'] = 'URL-адрес аутентификации';
$_['source_api_auth_url_i'] = '(Необязательно) Если ваш API требует подключения к URL-адресу аутентификации перед доступом к определенному URL-адресу для получения некоторых данных, используйте это поле для настройки URL-адреса аутентификации и укажите конечный URL-адрес в URL-адресе API. поле чуть выше';
$_['source_api_field'] = 'Поле данных';
$_['source_api_field_i'] = 'Обычно данные каждого элемента содержатся в определенном поле, необходимо поместить сюда имя этого поля, чтобы правильно пройти по каждому элементу. Если вы не знаете, что это такое, вам придется открыть файл, чтобы узнать имя поля контейнера.';
$_['source_path'] = 'Путь к локальному файлу';
$_['source_path_i'] = 'Это относится к файлу, который находится на вашем сервере';
$_['entry_preprocessor'] = 'Препроцессор';
$_['entry_preprocessor_i'] = 'Используйте препроцессор для преобразования вашего файла или выполнения определенных операций, которые были бы невозможны в остальной части модуля';
$_['text_extension_auto'] = 'Автоматическое определение расширения';
$_['text_compression_auto'] = 'Автоматическое определение сжатия';
$_['text_dropzone'] = 'Перетащите файл сюда или нажмите, чтобы загрузить';
$_['text_file_loaded'] = 'Файл загружен:';
$_['text_profile_loaded'] = 'Профиль:';
$_['text_cron_complete'] = '%s завершено:';
$_['text_file_error'] = 'Ошибка:';

// Step 2
$_['text_common_settings'] = 'Общие настройки';
$_['entry_xml_node'] = 'Узел элемента XML';
$_['entry_xml_node_i'] = 'Установите узел xml для каждого элемента в вашем файле, например <product> или <item> (задайте значение без скобок). Система попытается автоматически обнаружить его, просто измените его, если значение неверное';
$_['entry_xml_processor'] = 'XML-процессор';
$_['entry_xml_processor_i'] = 'Это механизм, который будет обрабатывать XML-файл. Попробуйте другой, если механизм по умолчанию у вас не работает';
$_['text_xml_processor_'] = 'ПО УМОЛЧАНИЮ — быстрая обработка XML';
$_['text_xml_processor_xri'] = 'РАСШИРЕННОЕ - Возможность использовать xpath в узле XML, медленнее';
$_['entry_csv_separator'] = 'Разделитель полей CSV';
$_['entry_csv_separator_i'] = 'Какой символ разделителя полей в вашем CSV-файле?';
$_['entry_csv_enclosure'] = 'Вложение поля CSV';
$_['entry_csv_enclosure_i'] = 'Какой символ включения поля в вашем CSV-файле?';
$_['entry_encoding'] = 'Кодировка символов';
$_['entry_encoding_i'] = 'Если ваши данные отображаются неправильно, попробуйте установить здесь правильную кодировку символов. Если вы не знаете, что это такое, попробуйте сначала использовать автоматическое определение или общие кодировки';
$_['entry_multiple_separator'] = 'Разделитель нескольких значений';
$_['entry_multiple_separator_i'] = 'Если поле содержит несколько значений, определите символ, используемый для их разделения';
$_['entry_xls_sheet'] = 'Рабочий лист';
$_['entry_xls_sheet_i'] = 'Если ваш файл содержит несколько листов, вы можете выбрать тот, с которым будете работать';
$_['entry_csv_header'] = 'Первая строка — заголовок';
$_['entry_item_identifier'] = 'Существующий идентификатор элемента';
$_['entry_item_identifier_i'] = 'Определить, существует ли элемент, который вы собираетесь вставить, если он соответствует этому полю';
$_['entry_identifier_mode'] = 'Условие идентификатора';
$_['entry_identifier_mode_i'] = 'Обычно используйте метод равенства, метод contains предназначен для очень специфического использования. Имейте в виду, что при неправильном использовании он может соответствовать большему количеству элементов, чем следует';
$_['text_identifier_mode_'] = 'Равно – совпадение по точному значению (ID123 = ID123)';
$_['text_identifier_mode_%'] = 'Содержит — совпадение по части значения (ID123 является частью ID123456)';
$_['entry_item_exists'] = 'Действие с существующим элементом';
$_['entry_item_exists_i'] = 'Режим замены: все значения будут обновлены, отображение пустого столбца означает, что любое фактическое значение будет удалено (при этом используется метод opencart по умолчанию и включает любые примененные к нему изменения) - Режим сохранения (если доступно): будут обновляться только поля, установленные при сопоставлении столбцов, пустое поле означает отсутствие изменения фактического значения (не метод opencart, пользовательские значения здесь не могут быть применены)';
$_['entry_item_not_exists'] = 'Действие по созданию нового элемента';
$_['text_image_settings'] = 'Настройки изображения';
$_['entry_image_download'] = 'Загрузить изображения';
$_['entry_image_download_i'] = 'Если изображение является внешним URL-адресом, автоматически загрузите его на свой сервер. Для связи существующих изображений используйте путь относительно папки /image/, например: каталог/test.jpg';
$_['entry_image_exists'] = 'Действие «Изображение существует»';
$_['entry_image_exists_i'] = 'Что делать, если изображение с таким именем уже существует?';
$_['entry_image_not_exists'] = 'Изображение не найдено';
$_['entry_image_not_exists_i'] = 'Что делать, если удаленное изображение не найдено или его не удалось загрузить?';
$_['entry_image_location'] = 'Местоположение изображения';
$_['entry_image_location_i'] = 'В случае загрузки изображений поместите их в определенный каталог (например: Products/). Этот параметр не используется в случае существующих изображений';
$_['entry_image_location_ph'] = 'новая_папка/';
$_['entry_image_keep_path'] = 'Репликация URL-адреса';
$_['entry_image_keep_path_i'] = 'Сохранять ту же структуру, что и в текущем местоположении. Например, если URL-адрес myshop.com/dir/subdir/image.jpg, изображение будет сохранено в каталоге dir/subdir/image.jpg.';
$_['entry_image_name_param'] = 'Параметр URL-адреса имени изображения';
$_['entry_image_name_param_i'] = 'Если имя изображения находится в параметре URL-адреса вместо основного имени файла, вы можете использовать этот параметр, чтобы получить правильное имя изображения, например URL-адрес, подобный этому http://website/getimage.php? img=product, в этом случае введите img в это поле';
$_['entry_image_name_param_ph'] = 'src';
$_['entry_image_remove_path'] = 'Удалить часть пути';
$_['entry_image_remove_path_i'] = 'Если есть часть пути к изображению, которую вы не хотите сохранять, просто напишите ее здесь, например. http://website/image/catalog/product/asus/image.jpg, вы хотите сохранить только путь asus/image.jpg, а затем поместить image/catalog/product/ в это поле';
$_['entry_image_remove_path_ph'] = 'изображение/каталог/';
$_['entry_image_sanitize'] = 'Очистить имя файла';
$_['entry_image_sanitize_i'] = 'Выберите способ сохранения пути к изображению. Файловый сейф удалит любой символ, который потенциально может вызвать проблемы при получении вашего изображения (специальные символы, пробелы и т. д.)';
$_['text_img_sanitize_default'] = 'По умолчанию — безопасное имя файла, строчные буквы';
$_['text_img_sanitize_safe'] = 'File Safe — безопасное имя файла, без изменения регистра';
$_['text_img_sanitize_lcase'] = 'Строчные буквы – нет файловой защиты, строчные буквы';
$_['text_img_sanitize_off'] = 'Выкл. — Файл не защищен, регистр не меняется';
$_['entry_image_http_auth'] = 'HTTP-аутентификация';
$_['entry_image_http_auth_i'] = 'Если сервер изображений требует HTTP-аутентификации, установленной в этом поле, разделенной двоеточием, например, имя пользователя:пароль';
$_['entry_image_http_auth_ph'] = 'имя пользователя:пароль';
$_['entry_image_width'] = 'Изменить размер изображения по ширине';
$_['entry_image_width_ph'] = '1000';
$_['entry_image_height'] = 'Изменить размер изображения по высоте';
$_['entry_image_height_ph'] = '750';
$_['text_delete_settings'] = 'Удалить или отключить элементы';
$_['entry_delete'] = 'Режим';
$_['entry_delete_action'] = 'Действие';
$_['entry_delete_batch'] = 'Импортировать метку';
$_['entry_delete_condition'] = 'Условие';
$_['text_no_condition'] = 'Нет условий';
$_['entry_no_delete_skipped'] = 'Пропущено';
$_['text_no_delete_skipped_off'] = 'Удалить также пропущенные элементы';
$_['text_no_delete_skipped_on'] = 'Не удалять пропущенные элементы';
$_['text_delete_nothing'] = 'Ничего не удалять';
$_['text_delete_all'] = 'Для всех элементов перед импортом';
$_['text_delete_batch'] = 'Для всех элементов определенной метки импорта';
$_['text_delete_missing'] = 'Только для необновленных элементов';
$_['text_delete_missing_brand'] = 'Для необновленных товаров, но только для обновленных брендов';
$_['text_delete_zero'] = 'Установить количество равным нулю';
$_['batch_delete_everything'] = 'Любая метка импорта';
$_['batch_delete_empty'] = 'Нет метки импорта';
$_['batch_delete_defined'] = 'Существующая метка импорта';
$_['batch_group_general'] = 'Удалить элементы с помощью:';
$_['batch_group_specific'] = 'Или только с определенной меткой импорта:';
$_['warning_delete'] = 'Внимание: элементы будут удалены из базы данных, убедитесь, что это именно то, что вам нужно';
$_['text_deleted'] = 'Удаленный элемент: ';
$_['text_nothing_deleted'] = 'удалять нечего';
$_['text_disabled_all'] = 'Отключить все элементы';
$_['text_delete_delete'] = 'Удалить (удалить из базы данных)';
$_['text_delete_disable'] = 'Отключить (установить статус отключен)';
$_['text_category_settings'] = 'Настройки категории';
$_['entry_category_create'] = 'Создать, если не существует';
$_['entry_include_subcat'] = 'Включить продукт в родительские элементы';
$_['entry_include_subcat_i'] = 'Если у вас есть категория, определенная следующим образом: Рабочий стол > ПК > Клавиатуры, то по умолчанию продукт перейдет в раздел "Клавиатуры", если вы установите родительский режим, он перейдет в раздел "Клавиатуры и ПК", а если вы установите значение все это будет относиться ко всем этим трем категориям»';
$_['entry_filter_identifier'] = 'Определить фильтры по';
$_['entry_filter_identifier_i'] = 'Как обнаружить существующие фильтры.';
$_['entry_filter_identifier_'] = 'Имя фильтра';
$_['entry_filter_identifier_1'] = 'Идентификатор фильтра';
$_['entry_filter_to_category'] = 'Автоматическое создание фильтров';
$_['entry_filter_to_category_i'] = 'Автоматически добавлять фильтры импортируемых товаров в соответствующие категории';
$_['text_include_subcat_none'] = 'Помещать товар только в определенную категорию';
$_['text_include_subcat_parent'] = 'Поместите товар также в родительскую категорию';
$_['text_include_subcat_all'] = 'Поместить товар во все родительские категории';
$_['text_manufacturer_settings'] = 'Настройки производителя';
$_['entry_manufacturer_create'] = 'Создать, если не существует';
$_['text_product_settings'] = 'Настройки продукта';
$_['entry_preserve_attribute'] = 'Сохранить атрибуты';
$_['entry_preserve_attribute_i'] = 'Если включенные атрибуты не будут сброшены при импорте, это работает только в режиме сохранения обновлений!';
$_['entry_auto_qty'] = 'Автоматический расчет количества';
$_['entry_auto_qty_i'] = 'Автоматически рассчитывать количество товара на основе количества опций';
$_['entry_auto_qty_'] = '';
$_['entry_auto_qty_1'] = 'Количество товара = суммарное количество опций';
$_['entry_auto_qty_2'] = 'Количество продукта = количество продукта + суммарное количество опций';
$_['entry_filter_generate'] = 'Сгенерировать фильтры из';
$_['entry_filter_generate_i'] = 'Отметьте эти параметры, чтобы автоматически генерировать фильтры продуктов на основе следующих полей';
$_['entry_limit'] = 'Ограничить импорт';
$_['entry_limit_i'] = 'Ограничить количество импортируемых элементов. Начало: начать с этой строки элементов. - Конец: остановиться на этой строке элементов. - Чтобы получить только последние 50 строк из файла, введите -50 в начало';
$_['entry_limit_start'] = 'Начальная строка';
$_['entry_limit_max'] = 'Максимальное количество предметов';
$_['text_extra_forced'] = 'Принудительно';
$_['text_existing_fields'] = 'Импортировать поля файла';
$_['text_extra_fields'] = 'Дополнительные поля';
$_['entry_extra_fields'] = 'Дополнительные поля';
$_['entry_extra_fields_i'] = 'Разделив запятыми, добавьте столько дополнительных полей, сколько вам нужно для дальнейшего использования с дополнительными функциями, например, вы можете выполнить некоторую операцию с существующим полем вашего фида, а затем сохранить результат в дополнительном поле ';
$_['text_extra_xpath'] = 'Запросы XPath';
$_['entry_extra_xpath'] = 'Запросы XPath';
$_['entry_extra_xpath_i'] = 'Insert here your XPath queries, one by line';
$_['entry_extra_xpath_eg'] = '<b>Example:</b><br>node[@lang=\'EN\']/value<br>node/subnode[2]<br>node/subnode[last()]';
$_['entry_extra_xpath_ph'] = 'XPath queries (one by line)';
$_['info_extra_xpath_title'] = 'How to use xpath queries?';
$_['info_extra_xpath'] = 'XPath is a query language for selecting nodes from an XML document.<br/>If the module does not manage to auto-detect some data in your xml you will be able to get it with an XPath query.<br/><br/><b>Important:</b> the xpath query is relative to the current item node, the one defined in Common settings > XML item node, so it is not necessary to include the item node name in your query, for example if the node you want to get is /products/product/attr/name and you have defined product as the item node then put your path relative to product, in this case just put attr/name<br/><br/>You will find below some examples of what you can do with XPath. All results retrieved by the XPath queries will be named like this <b>[your_xpath_query]result</b>
<table class="table" style="margin-top:15px">
<thead><tr><th>Xpath query</th><th>Result</th></tr></thead>
<tbody>
<tr><td><code>атрибуты/ширина</code></td><td>Базовый выбор узла/подузла</td></tr>
<tr><td><code>attributes/attribute[1]</code></td><td>Первый узел атрибута</td></tr>
<tr><td><code>attributes/attribute[last()]</code></td><td>Последний узел атрибута</td></tr>
<tr><td><code>attributes/attribute[@width]</code></td><td>Выберите узел на основе его параметра</td></tr>
<tr><td><code>attributes/attribute[@name=\'width\']</code></td><td>Выберите узел на основе значения его параметра</td></tr>
<tr><td><code>attributes/attribute[@name=\'info\']/value[@lang=\'EN\']</code></td><td>Значение параметра для подузла< /td></tr>
<tr><td><code>attributes[price>20]/price</code></td><td>Получить цену, если она превышает 20</td></tr>
<tr><td><code>attributes/*/name</code></td><td>Все узлы имен, содержащиеся в любом подузле атрибутов</td></tr>
</tbody>
</table>
';
$_['text_limit_settings'] = 'Ограничить набор данных';
$_['entry_limit_batch_status'] = 'Ограничить метку импорта';
$_['entry_limit_field_status'] = 'Ограничение на поле БД';
$_['entry_limit_field'] = 'Ограничить поле БД, если';
$_['import_all_attribute'] = 'Импортировать все атрибуты';
$_['import_product_review'] = 'Импортировать обзоры продуктов';
$_['text_import_product_review'] = 'Пожалуйста, выберите идентификатор продукта';
$_['text_identify_option_type'] = 'Идентифицировать по значению параметра';
$_['text_identify_option_field'] = 'Определить по дополнительному полю опции';
$_['import_product_attribute'] = 'Импортировать атрибуты продукта';
$_['text_import_product_attributes'] = 'Импортируйте атрибуты непосредственно в ваши товары, вам нужно выбрать идентификатор товара, к которому атрибут будет добавлен.';
$_['entry_delete_attributes'] = 'Очистить атрибуты';
$_['entry_delete_attributes_i'] = 'Включите эту опцию, если вы хотите, чтобы текущие атрибуты продукта были очищены перед импортом';
$_['entry_attribute_id'] = 'Идентификатор атрибута';
$_['entry_attribute_name'] = 'Имя атрибута';
$_['import_all_filter'] = 'Импортировать все фильтры';
$_['import_product_filter'] = 'Импортировать фильтры товаров';
$_['text_import_product_filters'] = 'Импортируйте фильтры непосредственно в ваши товары, вам нужно выбрать идентификатор товара, к которому будет добавлен фильтр.';
$_['import_category_filter'] = 'Импортировать фильтры категорий';
$_['text_import_category_filters'] = 'Импортируйте фильтры непосредственно в ваши категории, вам нужно выбрать идентификатор товара, куда будет добавлен фильтр.';
$_['entry_delete_filter'] = 'Очистить атрибуты';
$_['entry_delete_filter_i'] = 'Включите эту опцию, если вы хотите, чтобы текущие фильтры товаров были очищены перед импортом';
$_['entry_filter_id'] = 'Идентификатор фильтра';
$_['entry_filter_name'] = 'Имя фильтра';
$_['entry_sort_order'] = 'Порядок сортировки';
$_['entry_delete_filters'] = 'Удалить текущие фильтры';

// Step 3
$_['tab_order'] = 'Заказ';
$_['tab_info'] = 'Дополнительная информация';
$_['tab_extra'] = 'Произвольные поля';
$_['tab_seo'] = 'SEO';
$_['entry_extra'] = 'Произвольное поле';
$_['entry_extra_ml'] = 'Описание настраиваемого поля';
$_['entry_disable_config'] = 'Отключить конфигурацию';
$_['placeholder_disable_config'] = 'config_module_option, config_extra_option';
$_['placeholder_extra_col'] = 'Имя поля';
$_['tab_disable_cfg'] = 'Отключить параметры конфигурации';
$_['info_disable_cfg'] = 'Как и предыдущий вариант, это может быть полезно в случае, если какой-либо сторонний модуль захочет вставить данные о создании/редактировании элемента.<br/>Если у вас нет соответствующих данных при импорте файл и импорт не удается из-за отсутствия дополнительных данных, вы можете либо использовать опцию дополнительного поля с пустым значением, либо в некоторых случаях даже проще просто отключить соответствующую опцию конфигурации.<br/><br/>Например, если у вас в модели есть что-то вроде этого:<br/><code>if ($this->config->get(\'superfilter_status\')) {<br/>&nbsp;&nbsp;&nbsp;// вставляем данные модуля ...<br/>&nbsp;</code><br/><br/>Тогда, если эта часть кода приводит к сбою импорта, вы можете просто ввести поле под «superfilter_status», оно временно установит это установите для параметра значение false, чтобы избежать связанных с этим ошибок во время импорта.<br/>Используйте запятую в качестве разделителя, если вам нужно указать различные значения.';
$_['info_extra_field'] = 'Здесь вы можете определить свои собственные настраиваемые поля, это полезно, если у вас есть какой-либо модуль, который добавляет данные в ваши таблицы.<br/>Если настраиваемое поле многоязычное, то оно сохраняется в части описания, поэтому вам нужно использовать настраиваемое поле «Описание». Это может быть полезно, например, для модуля SEO, который добавляет SEO H1 и другие данные. Узнайте, какое имя используется этим модулем, и поместите «meta_h1» или «seo_h1» в поле. имя и в правом селекторе просто выберите, в какой столбец будут перенесены данные.<br/><br/>Если во время импорта у вас возникнут неопределенные ошибки индекса, это часто случается, потому что у вас есть настраиваемые поля, добавленные модулями, поэтому вы Если вам придется использовать этот раздел, чтобы добавить их для процесса импорта, ошибка сообщит вам, какое точное имя требуется.<br/><br/>Имя настраиваемого поля должно быть установлено так, как оно отображается в вашей базе данных.<br/ ><br/><b>Принудительно</b><br/>Если вы выберете эту опцию, модуль будет обновлять значение в базе данных независимо от того, что ожидает ваша opencart, вы должны использовать его только в том случае, если ваша модель продукта не изменена. для обработки пользовательского значения, которое вы собираетесь обновить. Поэтому, если у вас есть собственный модуль, который обрабатывает данные, вы не должны устанавливать обязательный флажок, и вам нужно установить имя поля не так, как оно есть в базе данных, а так, как оно есть в вашей форме продукта (вы можете выполнить элемент проверки на поле формы, чтобы узнать имя вашего элемента).';
$_['text_remove_extra_col'] = 'Удалить настраиваемое поле';
$_['text_add_extra_field'] = 'Добавить новое настраиваемое поле';
$_['text_add_extra_field_ml'] = 'Добавить новое настраиваемое поле описания';
$_['text_add_advanced_fields'] = 'Добавить новые расширенные поля';
$_['tab_functions'] = 'Дополнительные функции';
$_['text_add_function'] = 'Добавить функцию';
$_['text_function_type'] = 'Тип';
$_['text_function_action'] = 'Действие';
$_['text_function_target'] = 'Сохранить результат';
$_['text_function_same_field'] = 'Текущее поле';
$_['text_function_extra_field'] = 'Дополнительное поле';
$_['text_remove_function'] = 'Удалить функцию';
$_['info_identifier_title'] = 'Идентификатор элемента';
$_['info_identifier'] = 'Поле ниже является обязательным, поскольку именно оно используется для идентификации обновляемого элемента.';
$_['tab_quick_update'] = 'Быстрое обновление';
$_['entry_option_identifier'] = 'Идентификатор опции';
$_['entry_option_identifier_i'] = 'Оставьте пустым, чтобы обновить основной продукт';
$_['entry_option_identifier_value'] = 'Значение опции';
$_['text_quick_update_identifier'] = 'Здесь вы можете быстро обновить свои элементы, используя наиболее распространенные обновляемые значения.<br/>Поле ниже является обязательным, поскольку именно оно используется для идентификации обновляемого элемента.';
$_['text_quick_update_option_identifier'] = '<h4>Обновить опцию продукта</h4>Если вы хотите обновить только количество опций продукта, вам необходимо указать опцию продукта в следующих полях, выберите опцию и то, что ей соответствует. в вашем фиде импорта.<br/>Например, идентификатор параметра — «Цвет», а в значении параметра выберите поле, внутри которого указан цвет.';
$_['entry_product_id'] = 'Идентификатор продукта';
$_['entry_attribute_group_id'] = 'Идентификатор группы атрибутов';
$_['help_field_attribute_group_id'] = 'Оставьте пустым для автоматического создания';
$_['entry_title'] = 'Название';
$_['entry_fax'] = 'Факс';
$_['entry_total'] = 'Итого';
$_['entry_shipping_code'] = 'Код доставки';
$_['entry_paid_code'] = 'Код платежа';
$_['entry_paid_code'] = 'Код платежа';
$_['entry_order_status_id'] = 'Идентификатор статуса заказа';
$_['entry_paid_method_name'] = 'Название метода оплаты';
$_['entry_paid_method_code'] = 'Код способа оплаты';
$_['help_field_paid_method_name'] = 'Название способа оплаты, которое будет отображаться в заказе, вы можете установить только его, если код не установлен, он просто не будет предварительно выбран при редактировании заказа';
$_['help_field_Payment_method_code'] = 'Здесь ожидается код в формате opencart, например Bank_transfer, Cod, PayPal, Free_Checkout';
$_['entry_shipping_method_name'] = 'Название метода доставки';
$_['entry_shipping_method_code'] = 'Код метода доставки';
$_['help_field_shipping_method_name'] = 'Название метода доставки, которое будет отображаться в заказе, вы можете установить только его, если код не установлен, он просто не будет предварительно выбран при редактировании заказа';
$_['help_field_shipping_method_code'] = 'Здесь ожидается код в формате opencart, например бесплатный, плоский, FedEx, вес';
$_['entry_total_code'] = 'Общий код';
$_['help_field_code'] = 'Общий код в формате opencart, например, total, sub_total, доставка, налог';
$_['entry_advanced_discount'] = 'Расширенная скидка';
$_['entry_advanced_discount_i'] = 'Установить данные для каждой группы клиентов';
$_['entry_advanced_special'] = 'Расширенная специальная цена';
$_['entry_advanced_special_i'] = 'Установите данные для каждой группы клиентов';
$_['entry_description'] = 'Описание';
$_['entry_model'] = 'Модель';
$_['entry_price'] = 'Цена';
$_['entry_tax'] = 'Налог';
$_['entry_order_id'] = 'Идентификатор заказа';
$_['entry_order_id_user'] = 'Случайный идентификатор заказа';
$_['entry_create_order_total'] = 'Автоматическое создание итогового элемента';
$_['entry_notify'] = 'Уведомить';
$_['entry_tracking_no'] = 'Номер отслеживания';
$_['entry_tracking_url'] = 'URL-адрес отслеживания';
$_['entry_order_status_comment'] = 'Комментарий';
$_['entry_order_status'] = 'Статус заказа';
$_['help_field_order_status'] = 'Все заказы будут обновлены с заданным статусом заказа, это может быть идентификатор статуса заказа или имя, вы также можете оставить пустым и принудительно указать статус заказа с помощью поля по умолчанию';
$_['entry_seo_keyword'] = 'Ключевое слово SEO';
$_['entry_seo_h1'] = 'SEO H1';
$_['entry_seo_h2'] = 'SEO H2';
$_['entry_seo_h3'] = 'SEO H3';
$_['entry_seo_canonical'] = 'Канонический путь';
$_['entry_seo_canonical_i'] = 'Это дополнительное поле из полного пакета SEO. Введите здесь категорию, чтобы применить определенный канонический путь. Если ничего не установлено, будет использоваться настройка по умолчанию.';
$_['entry_meta_title'] = 'Заголовок метатега';
$_['entry_meta_description'] = 'Описание метатега';
$_['entry_meta_keyword'] = 'Ключевые слова мета-тегов';
$_['entry_img_title'] = 'Название изображения';
$_['entry_img_alt'] = 'Изображение alt';
$_['entry_separator'] = 'Разделитель';
$_['entry_category_separator'] = 'Разделитель нескольких значений';
$_['entry_category_separator_i'] = 'Если поле содержит несколько значений, определите символ, используемый для их разделения';
$_['entry_subcat_separator'] = 'Разделитель подкатегорий';
$_['entry_subcat_separator_i'] = 'Например, cat1 > subcat1 ; кот2 > субкат2';
$_['entry_dimension_l'] = 'Длина';
$_['entry_dimension_w'] = 'Ширина';
$_['entry_dimension_h'] = 'Высота';
$_['entry_category_id'] = 'Идентификатор категории';
$_['entry_information_id'] = 'Идентификатор информации';
$_['entry_manufacturer_id'] = 'Идентификатор производителя';
$_['entry_customer_id'] = 'Идентификатор клиента';
$_['entry_code'] = 'Код категории';
$_['entry_value_modifier'] = 'Режим';
$_['entry_value_modifier_i'] = 'Заменить: заменить фактическое значение на новое - Добавить: добавить новое значение к фактическому - Вычесть: вычесть новое значение из фактического';
$_['entry_email'] = 'Электронная почта';
$_['import_default_value'] = 'По умолчанию';
$_['entry_default'] = 'По умолчанию';
$_['entry_default_i'] = 'Вставьте здесь значение по умолчанию для этого поля. Если поле пусто или не сопоставлено ни с каким значением, будет использоваться значение по умолчанию';
$_['help_field_category'] = 'Если в этом поле определено несколько категорий, используйте разделитель нескольких значений, например: Cat1 > subcat1 ; Cat2 > субкат2';
$_['help_field_related_id'] = 'Используйте множественный разделитель для вставки нескольких значений, значением может быть идентификатор продукта или идентификатор товара, заданный на шаге 2';
$_['help_field_image'] = 'Если значений несколько, выбирается первое';
$_['help_field_product_image'] = 'Чтобы импортировать различные изображения, вы можете использовать одно поле с несколькими разделителями или нажать «Добавить столбцы», чтобы получить изображения из разных полей';
$_['help_field_product_option_xml__'] = 'Используйте этот формат: <option> <optionType>type</optionType> <optionNameEn>Имя английское</optionNameEn> <optionValueEn>Значение английское</optionValueEn> <optionPrice>Цена</optionPrice> <optionRequired>Обязательно</optionRequired> </option> — параметры и значения параметров создаются автоматически, если они не существуют.';
$_['help_field_product_option__'] = 'Может быть отформатировано различными способами - 1: <имя>:<значение> (тип автоматически устанавливается для выбора, если параметр не существует) - 2: <тип>:<имя>:< значение> 3: <тип>:<имя>:<значение>:<цена> - 4: <тип>:<имя>:<значение>:<цена>:<количество> - 5: <тип>:<имя >:<значение>:<цена>:<количество>:<вычитание> - 6: <тип>:<имя>:<значение>:<цена>:<количество>:<вычитание>:<вес> - 7: <type>:<name>:<value>:<price>:<qty>:<subtract>:<weight>:<required> — Опции и значения опций создаются автоматически, если они не существуют.';
$_['help_field_product_attribute__'] = 'Может быть отформатировано различными способами - 1: <attribute_group_name>:<attribute_name>:<value> - 2: <attribute_name>:<value> 3: <value> (заголовок используется как атрибут name) - 4: <ul><li>Имя группы: значение</li></ul>Группа и атрибут создаются автоматически, если они не существуют. В случаях 2 и 3, если атрибут не существует, он назначается группе «По умолчанию»';
//$_['help_field_product_discount'] = 'Должен быть отформатирован следующим образом: <цена> - или <цена>:<дата_конец> - или <цена>:<дата_начало>:<дата_конец> - или <количество>:<цена >:<date_start>:<date_end> - или <customer_group_id>:<qty>:<price>:<date_start>:<date_end> - или <customer_group_id>:<qty>:<priority>:<price>:<date_start >:<конец_даты>';
$_['help_field_product_id'] = 'Используйте это, если хотите принудительно указать идентификатор продукта';
$_['help_field_manufacturer_id'] = 'Используйте либо идентификатор производителя, либо имя производителя';
$_['help_field_product_category'] = 'Используйте либо идентификатор категории, либо название категории. Вы можете добавить столько подкатегорий, сколько необходимо, они будут следовать установленному здесь порядку';
$_['help_field_product_filter'] = 'Отформатируйте фильтры следующим образом: filter_group:filter_name';
$_['help_field_product_related'] = 'Соответствующий продукт будет обнаружен по его идентификатору, названию, модели, артикулу, EAN или UPC';
$_['help_field_stock_status_id'] = 'Работает с названием акции или идентификатором, если имя не существует, оно будет создано';
$_['help_field_status'] = $_['help_field_notify'] = $_['help_field_newsletter'] = $_['help_field_safe'] = $_['help_field_approved'] = 'Это работает со следующими значениями: 1/0 , вкл./выкл., истина/ложь, включено/отключено, да/нет, активно/неактивно';
$_['help_field_order_status_comment'] = 'Вы можете использовать эти теги: {tracking_no} {tracking_url}';
$_['help_field_parent_id'] = 'Если более двух уровней, это поле должно быть отформатировано с использованием разделителя подкатегорий: Cat1 > Subcat1 > Subcat2';
$_['entry_children'] = 'Дети';
$_['help_field_children'] = 'Используйте это поле, чтобы установить дочерние элементы этой категории';
$_['entry_children_id'] = 'Идентификатор ребенка';
$_['help_field_children_id'] = 'Установите здесь идентификаторы, если вам нужно импортировать категории с соответствующими идентификаторами';
$_['entry_date_start'] = 'Дата начала';
$_['entry_date_end'] = 'Дата окончания';
$_['entry_salt'] = 'соль';
$_['help_field_password'] = '';
$_['help_field_salt'] = 'Соль — это дополнительная защита пароля. Если вы собираетесь импортировать зашифрованный пароль, использующий соль, вам также необходимо заполнить соль, чтобы иметь возможность войти в систему, если зашифрованный пароль не работает. используйте соль (например, базовый MD5), затем оставьте это поле пустым';
$_['entry_pwd_hash'] = 'Шифрование';
$_['entry_pwd_hash_i'] = 'Если ваш пароль зашифрован, проверьте соответствующее значение здесь и заполните поле соли, которое необходимо клиенту для входа в систему';
$_['text_pwd_clear'] = 'Очистить пароль';
$_['text_pwd_hash'] = 'Зашифрованный пароль';
$_['entry_invoice_no'] = 'Номер счета';
$_['entry_invoice_prefix'] = 'Префикс счета-фактуры';
$_['entry_user_agent'] = 'Пользовательский агент';
$_['entry_accept_language'] = 'Принять язык';
$_['entry_option_price_mode'] = 'Режим цены опциона';
$_['entry_option_price_mode_i'] = 'Как определяется цена вашего опциона?';
$_['text_option_price_mode_rel'] = 'Цена опциона зависит от цены продукта (например, +10, -5)';
$_['text_option_price_mode_abs'] = 'Цена опциона — окончательная цена опциона (например, 110, 95)';
$_['entry_option_quantity_mode'] = 'Режим количества опционов';
$_['entry_option_quantity_mode_i'] = 'Хотите, чтобы количество товара суммировалось с количеством опций?';
$_['text_option_qty_mode_default'] = 'Не суммировать количество опций с количеством продукта';
$_['text_option_qty_mode_sum'] = 'Суммируйте количество опций к количеству продукта';
$_['entry_option_format'] = 'Формат строки';
$_['entry_option_format_i'] = 'Выберите конкретный формат строки, содержащей параметры, разделенные двоеточием; если они разделены другим символом, используйте дополнительную функцию для установки соответствующего разделителя';
$_['entry_include_option'] = 'Включить определенные параметры';
$_['entry_include_option_i'] = 'Если собираемые вами данные содержат больше параметров, чем вы хотели бы импортировать, вы можете использовать это поле, чтобы ограничить импорт нужных имен параметров, например, если у вас есть параметры «Размер», «Цвет» и «Цвет». Вес, и вы хотите получить только Размер и Цвет, затем введите Размер|Цвет в это поле, используйте Tube | в качестве разделителя.';
$_['entry_insert_method'] = 'Режим обновления';
$_['entry_insert_method_i'] = 'Выберите, хотите ли вы сохранить текущие значения или заменить их';
$_['entry_insert_method_'] = 'Заменить — заменены все значения';
$_['entry_insert_method_update'] = 'Обновить - текущие значения обновляются - добавляются новые';
$_['entry_insert_method_add'] = 'Добавить — добавить значения, даже если они уже существуют';
$_['entry_insert_method_rm_add'] = 'Удалить при первом импорте и добавить при следующем импорте';
$_['entry_product_name'] = 'Название продукта';
$_['entry_customer'] = 'Клиент';
$_['entry_author'] = 'Автор';
$_['entry_text'] = 'Текст';
$_['entry_rating'] = 'Рейтинг';
$_['entry_date_added'] = 'Дата добавления';
$_['entry_date_modified'] = 'Дата изменения';

// extra functions
$_['xfn_group_string'] = 'Текстовые операции';
$_['xfn_group_regex'] = 'Текстовые операции с регулярными выражениями';
$_['xfn_group_number'] = 'Числовые операции';
$_['xfn_group_html'] = 'HTML';
$_['xfn_group_product'] = 'Продукт';
$_['xfn_group_web'] = 'Удаленный контент';
$_['xfn_group_other'] = 'Специальные функции';
$_['xfn_group_currency'] = 'Валюта';
$_['xfn_manual_value'] = 'Ручное значение -&gt;';
$_['xfn_append'] = '<i class="fa fa-fw">&#xf038;</i> Append';
$_['xfn_append_i'] = 'Добавить что-нибудь после поля';
$_['xfn_prepend'] = '<i class="fa fa-fw">&#xf036;</i> Добавить';
$_['xfn_prepend_i'] = 'Добавить что-нибудь перед полем';
$_['xfn_combine'] = '<i class="fa fa-fw">&#xf1b3;</i> Объединить';
$_['xfn_combine_i'] = 'Объедините несколько полей в одну строку, выберите разделитель, который будет вставлен между каждым полем, пустые поля будут игнорироваться, если ваше поле представляет собой массив, то каждое значение массива также будет объединено' ;
$_['xfn_uppercase'] = '<i class="fa fa-fw">&#xf031;</i> Прописные буквы';
$_['xfn_uppercase_i'] = 'Пример: ЛЮК, Я ТВОЙ ОТЕЦ';
$_['xfn_lowercase'] = '<i class="fa fa-fw">&#xf031;</i> Нижний регистр';
$_['xfn_lowercase_i'] = 'Пример: Люк, я твой отец';
$_['xfn_ucfirst'] = '<i class="fa fa-fw">&#xf031;</i> Первая буква в верхнем регистре';
$_['xfn_ucfirst_i'] = 'Пример: Люк, я твой отец';
$_['xfn_ucwords'] = '<i class="fa fa-fw">&#xf031;</i> Прописные буквы первых слов';
$_['xfn_ucwords_i'] = 'Пример: Люк, я твой отец';
$_['xfn_substr'] = '<i class="fa fa-fw">&#xf0c4;</i> Обрезать строку';
$_['xfn_substr_i'] = 'Получить x первых символов поля';
$_['xfn_strlen'] = '<i class="fa fa-fw">&#xf121;</i> Подсчет символов или массива';
$_['xfn_strlen_i'] = 'Подсчет количества символов в строке или количества элементов в массиве';
$_['xfn_urlify'] = '<i class="fa fa-fw">&#xf0c1;</i> Формат URL';
$_['xfn_urlify_i'] = 'Отформатируйте строку для использования в ключевом слове SEO, примените строчные буквы и замените пробелы тире. Если применяется транслит, все подчеркнутые символы будут преобразованы в их эквиваленты в формате ASCII';
$_['xfn_substr_set'] = 'Обрезать количество символов';
$_['xfn_substr_of'] = 'От';
$_['xfn_nl2br'] = '<i class="fa fa-fw">&#xf121;</i> Преобразовать разрывы строк в HTML';
$_['xfn_nl2br_i'] = 'Разрывы строк будут преобразованы в формат HTML с помощью тега br';
$_['xfn_strip_tags'] = '<i class="fa fa-fw">&#xf121;</i> Удалить HTML-теги';
$_['xfn_strip_tags_i'] = 'Удалите любой HTML-тег, чтобы получить чистый текст';
$_['xfn_html_encode'] = '<i class="fa fa-fw">&#xf121;</i> Кодировать объекты HTML';
$_['xfn_html_encode_i'] = 'Преобразовать специальные символы в объекты HTML';
$_['xfn_urlencode'] = '<i class="fa fa-fw">&#xf121;</i> Закодировать URL';
$_['xfn_urldecode'] = '<i class="fa fa-fw">&#xf121;</i> Декодировать URL';
$_['xfn_html_decode'] = '<i class="fa fa-fw">&#xf121;</i> Декодировать объекты HTML';
$_['xfn_html_decode_i'] = 'Преобразуйте все объекты HTML в соответствующие символы - может быть полезно, если у вас есть некоторый HTML-контент, импортированный неправильно';
$_['xfn_date_convert'] = '<i class="fa fa-fw">&#xf073;</i> Конвертер дат';
$_['xfn_date_convert_i'] = 'Преобразуйте дату в определенный формат. Выберите текущий формат поля даты, чтобы правильно преобразовать ее';
$_['xfn_field_replace_set'] = 'Если';
$_['xfn_field_replace'] = '<i class="fa fa-fw">&#xf059;</i> Замена поля';
$_['xfn_field_replace_i'] = 'Заменить поле другим в зависимости от выбранного вами условия';
$_['xfn_if_table'] = '<i class="fa fa-fw">&#xf059;</i> Условные значения';
$_['xfn_if_table_i'] = 'Установите окончательные значения в зависимости от вашего фактического значения, используйте оператор для сравнения со значением поля и выберите окончательное значение. Пример: ~(wheels):Car означает, что если текущее поле содержит слово Wheels, то в качестве выходных данных следует установить Car.';
$_['xfn_replace'] = '<i class="fa fa-fw">&#xf0d0;</i> Заменить текст';
$_['xfn_tag'] = '<i class="fa fa-fw">&#xf02b;</i> Вставить специальное значение';
$_['xfn_tag_i'] = 'Используйте доступный тег, чтобы заменить его нужным значением';
$_['text_xfn_tag_available'] = '[current_row] Номер текущей строки импорта<br/>
[unique_id] Создать уникальную случайную строку<br/>';
$_['xfn_replace_set'] = 'Заменить';
$_['xfn_regex_replace'] = '<i class="fa fa-fw">&#xf0d0;</i> Замена регулярного выражения';
$_['xfn_regex_replace_i'] = 'Замените часть строки, используя регулярное выражение, например, если вы хотите изменить поле типа Brand:Sony|type:Laptop, чтобы указать MyBrand вместо любого другого бренда, следуя поиску по регулярному выражению: Brand: (.+)| заменить: бренд:MyBrand|';
$_['xfn_regex'] = '<i class="fa fa-fw">&#xf0c4;</i> Извлечение регулярного выражения';
$_['xfn_regex_i'] = 'Извлеките часть строки с помощью регулярного выражения. Используйте (), чтобы определить часть, которую вы хотите извлечь, например, если у вас есть такое поле, как бренд:Sony|type:Laptop, и вы хотите чтобы извлечь Sony для вставки в бренды, примените следующее регулярное выражение: Brand:(.+)|';
$_['xfn_regex_remove'] = '<i class="fa fa-fw">&#xf12d;</i> Удаление регулярного выражения';
$_['xfn_regex_remove_i'] = 'Удалить текст с помощью регулярного выражения, например удалить любой специальный символ из строки: [^0-9a-zA-Z]';
$_['xfn_remove'] = '<i class="fa fa-fw">&#xf12d;</i> Удалить текст';
$_['xfn_remove_set'] = 'Удалить';
$_['xfn_remote_content_set'] = 'Получить контент по URL-адресу поля';
$_['xfn_remote_api'] = '<i class="fa fa-fw">&#xf019;</i> Получить данные из удаленного API';
$_['xfn_remote_content'] = '<i class="fa fa-fw">&#xf019;</i> Удаленное содержимое HTML';
$_['xfn_remote_content_i'] = 'Получить содержимое страницы, содержащееся в URL-адресе, может быть полезно, если в фиде указана только ссылка для получения описания или других данных.';
$_['xfn_add'] = '<i class="fa fa-fw">&#xf1ec;</i> Добавить';
$_['xfn_subtract'] = '<i class="fa fa-fw">&#xf1ec;</i> Вычесть';
$_['xfn_multiply'] = '<i class="fa fa-fw">&#xf1ec;</i> Multiply';
$_['xfn_random'] = '<i class="fa fa-fw">&#xf1ec;</i> Случайное число';
$_['xfn_random_i'] = 'Сгенерируйте случайное число, установите минимальное и максимальное значения, чтобы получить число между этим диапазоном. Если вы хотите десятичное число, поместите числа с десятичными знаками в минимальное и максимальное значение';
$_['xfn_percentage'] = '<i class="fa fa-fw">&#xf1ec;</i> Процент';
$_['xfn_percentage_i'] = 'Примените процент к числу, используйте отрицательное число для вывода, например 20 означает добавление 20%, а -20 означает вычет 20%';
$_['xfn_percentage_set'] = 'Применить процент';
$_['xfn_divide'] = '<i class="fa fa-fw">&#xf1ec;</i> Divide';
$_['xfn_round'] = '<i class="fa fa-fw">&#xf1ec;</i> Round';
$_['xfn_to_float'] = '<i class="fa fa-fw">&#xf1ec;</i> Преобразовать число через запятую';
$_['xfn_to_float_i'] = 'Если у вас есть число с запятой в качестве десятичного разделителя, оно может быть неправильно вставлено (десятичная полоса), примените эту функцию, чтобы преобразовать его в правильное значение с плавающей запятой';
$_['placeholder_xfn_if_table'] = '~(search_value):final_value (по одному в строке)';
$_['placeholder_xfn_wholesale'] = 'max_price:множитель (по одному на строку)';
$_['xfn_wholesale'] = '<i class="fa fa-fw">&#xf1ec;</i> Калькулятор оптовых цен';
$_['xfn_wholesale_i'] = 'Умножьте текущую цену на разные коэффициенты в зависимости от значения. Например, если вы хотите, чтобы все цены ниже 10 умножались на 2, просто напишите 10:2, тогда если вы хотите, чтобы все цены ниже 50 умножить на 1,5, добавить новую строку и написать 50:1,5, вы также можете использовать процентные и отрицательные проценты, 10%, чтобы добавить 10%, -20%, чтобы вывести 20%';
$_['xfn_skip_set'] = 'Пропустить текущий элемент, если';
$_['xfn_skip_db_set'] = 'Пропустить текущий элемент, если';
$_['xfn_option'] = '<i class="fa fa-fw">&#xf0c9;</i> Вариант продукта';
$_['xfn_option_set'] = 'Текущая строка является опцией продукта if';
$_['xfn_skip'] = '<i class="fa fa-fw">&#xf054;</i> Пропустить значение импорта';
$_['xfn_skip_i'] = 'Пропустить текущий элемент импорта, если значение значения в вашем файле импорта соответствует другому значению (значению файла импорта или значению, введенному вручную)';
$_['xfn_skip_db_i'] = 'Пропустить текущий элемент импорта, если значение элемента вашего магазина соответствует другому значению (значению файла импорта или значению, заданному вручную)';
$_['xfn_skip_db'] = '<i class="fa fa-fw">&#xf054;</i> Пропустить существующее значение';
$_['xfn_delete_item'] = '<i class="fa fa-fw">&#xf014;</i> Удалить или отключить элемент';
$_['xfn_multiple_separator'] = '<i class="fa fa-fw">&#xf03a;</i> Разделитель нескольких значений';
$_['xfn_multiple_separator_i'] = 'Вы можете использовать эти теги: [\n] для разрыва строки и [\t] для табуляции';
$_['xfn_multiple_separator_set'] = 'Установить разделитель нескольких значений как';
$_['xfn_oc_currency'] = '<i class="fa fa-fw">&#xf155;</i> Конвертировать в валюту OC';
$_['xfn_oc_currency_i'] = 'Конвертируйте в валюту opencart по умолчанию, используя курсы, хранящиеся в вашей opencart';
$_['xfn_currency_from'] = 'Конвертировать из';
$_['xfn_for_column'] = 'Для столбца';
$_['xfn_source_field'] = 'Исходное поле';
$_['xfn_target_field'] = 'Целевое поле';
$_['text_if_table_table'] = '<div style="cursor:text;font-size:12px">Условная таблица<br/><span style="color:#888"><b>Равно</b ><br/>=(test):final_value<br/>!=(test):final_value<br/><b>Содержит</b><br/>~(test):final_value<br/>!~ (test):final_value<br/><b>Больше</b><br/>&gt;(test):final_value<br/>&lt;(test):final_value<br/>Используйте {current} для текущего value<br/>Используйте & для нескольких</span></div>';
$_['text_wholesale_table'] = 'Оптовая таблица<div style="color:#888;font-size:11px"><b>Пример:</b><br/>50:-4%<br/> 100:*2<br/>500:20%<br/>1000:+30<br/><b>Означает:</b><br/>от 0 до 50: выведите 4%<br/>50 до 100: умножить на 2<br/>100 к 500: прибавить 20%<br/>500 к 1000: прибавить 30</div>';
$_['text_round'] = 'Круглый';
$_['text_replace_by'] = 'Заменить на';
$_['xfn_if'] = 'Если';
$_['xfn_of'] = 'Выкл';
$_['xfn_to'] = 'Кому';
$_['xfn_by'] = 'По';
$_['xfn_in'] = 'Вход';
$_['xfn_for'] = 'Для';
$_['xfn_from'] = 'От';
$_['xfn_after'] = 'После';
$_['xfn_before'] = 'До';
$_['xfn_is_equal'] = 'равно';
$_['xfn_is_equal_list'] = 'равен (список, разделенный |)';
$_['xfn_is_not_equal'] = 'не равно';
$_['xfn_is_not_equal_list'] = 'не равно (список, разделенный |)';
$_['xfn_contain'] = 'содержит';
$_['xfn_not_contain'] = 'не содержать';
$_['xfn_is_greater'] = 'больше чем';
$_['xfn_is_lower'] = 'ниже, чем';
$_['xfn_mode'] = 'Режим';
$_['xfn_precision'] = 'С точностью';
$_['xfn_precision_'] = 'Нет раунда';
$_['xfn_precision_0'] = 'Целое число (1)';
$_['xfn_precision_1'] = '1 десятичная (1,2)';
$_['xfn_precision_2'] = '2 десятичных знака (1,23)';
$_['xfn_precision_3'] = '3 десятичных знака (1,234)';
$_['xfn_precision_4'] = '4 десятичных знака (1,2345)';
$_['text_combine_fields'] = 'Объединить поля';
$_['text_delete_if'] = 'Удалить, если';
$_['text_value_is'] = 'Равно';
$_['text_urlify_basic'] = 'Базовый';
$_['text_urlify_default'] = 'Базовое форматирование';
$_['text_urlify_ascii'] = 'Транслит в ascii';
$_['text_translit'] = 'Транслит';
$_['info_extra_functions'] = 'С помощью дополнительных функций вы можете выполнять некоторые определенные операции с исходными данными, например, умножать число или помещать строку в верхний регистр и т. д.<br/><br/>Использование:< ol><li>Выберите нужную функцию в поле ниже.</li><li>Нажмите «Добавить функцию».</li><li>Выберите исходное поле, к которому нужно применить функцию.</li><li> >Определите другие параметры, если таковые имеются</li><li>Выберите целевое поле, в котором вы хотите сохранить результат</li></ol>Вы можете применить несколько операций к одному и тому же полю, они будут применены в порядке они определены.<br/><br/>Если вы хотите сохранить некоторые данные в дополнительных полях, не забудьте добавить дополнительные поля на шаге 2.';
$_['text_date_format_eu'] = 'ЕС: ДД/ММ/ГГГГ';
$_['text_date_format_us'] = 'США: ММ/ДД/ГГГГ';
$_['text_date_format_sql'] = 'SQL: ГГГГ-ММ-ДД';
$_['text_date_format_xls'] = 'Excel: дата — целое число';
$_['text_convert_from'] = 'Конвертировать из';
$_['text_convert_to'] = 'Преобразовать в';
$_['text_convert_to_i'] = 'Оставьте пустым для преобразования в формат даты sql, который удобен для дат OpenCart, для преобразования в другой формат см. доступное форматирование для функции date() PHP, например d-m-Y';
$_['text_col_set_to_default'] = 'Установить значение по умолчанию ->';

// option bindings
$_['text_optbinding_name'] = 'Тип';
$_['text_optbinding_bind_to'] = 'Поле';
$_['text_get_optbinding'] = 'Получить поля дополнительных опций';

// category bindings
$_['tab_cat_binding'] = 'Привязка категорий';
$_['entry_cat_binding_mode'] = 'Режим привязки';
$_['text_cat_binding_default'] = 'Смешанный - вставьте связанные и не связанные категории со значением поля';
$_['text_cat_binding_exclusive'] = 'Эксклюзивно — вставлять только связанные категории, значение поля категории игнорируется';
$_['text_cat_binding_exclusive_skip'] = 'Эксклюзивно, пропустить пустое - вставить только связанные категории, значение поля категории игнорируется, пропустить элемент, если категории нет';
$_['text_cat_binding_skip'] = 'Пропустить несвязанную категорию — вставлять только связанные категории, элементы хотя бы с одной несвязанной категорией будут пропущены';
$_['text_catbinding_name'] = 'Категория источника';
$_['text_catbinding_bind_to'] = 'Привязать к';
$_['text_get_bindings'] = 'Обновить список категорий';
$_['text_no_bindings'] = 'Привязка категорий не определена. Нажмите кнопку обновления, чтобы просмотреть все категории в фактическом файле импорта.';
$_['text_no_binding'] = '- нет -';
$_['info_cat_binding_title'] = 'Привязка категорий';
$_['info_cat_binding'] = '<p>Если в ваших исходных данных есть имена категорий, которые не соответствуют вашим, вы можете использовать эту функцию, чтобы определить привязку для каждой категории в вашем исходном файле.<br/><br />Использование:<ul><li>Если это еще не сделано, выберите поле категории на вкладке «Ссылки».</li><li>Нажмите «Обновить список категорий», чтобы получить список всех категорий, существующих в исходном файле< /li><li>Выберите, в какую категорию opencart вы хотите перенести каждую исходную категорию.</li></ul>Не обязательно устанавливать все категории, просто удалите те, которые не требуют привязки, для них поведение по умолчанию будут применены (проверьте, существует ли категория, и попытайтесь создать ее, если нет).<br/>Если вы хотите, чтобы категории вставлялись только на основе связанных значений, выберите режим привязки exclisve.</p><h4>Привязка пример режимов</h4><p>
<b>Пример категорий:</b><br/>
- В вашей корзине: КОМПЬЮТЕРЫ, АКСЕССУАРЫ<br/>
- В файле импорта: ПК, MAC, ЧАСТИ<br/><br/>
<b>Конфигурация:</b><br/>
ПК и MAC привязаны к вашей OC категории КОМПЬЮТЕРЫ<br/>
PARTS не привязан ни к одной из ваших категорий OC<br/><br/>
<b>Результат:</b>
</ul>
<li><b>Смешанный</b>: продукты для ПК и MAC попадают в категорию КОМПЬЮТЕРЫ, категория ЧАСТИ создается, поскольку она не привязана.</li>
<li><b>Эксклюзивно</b>: продукты для ПК и MAC переходят в категорию КОМПЬЮТЕРЫ, продукты с ЧАСТЯМИ будут созданы, но им не будет присвоена никакая категория.</li>
<li><b>Эксклюзивно, пропустить пустое</b>: продукты для ПК и MAC переходят в категорию КОМПЬЮТЕРЫ, продукты с ЧАСТЯМИ создаваться не будут.</li>
<li><b>Пропустить привязку</b>: товары для ПК и MAC переходят в категорию КОМПЬЮТЕРЫ. Если для продукта определены две категории, такие как ЧАСТИ и ПК, то элемент не будет создан, поскольку одна из его категорий не создана. ограничено (ЧАСТИ)</li>
</ul></p>';
$_['info_col_binding_skip'] = 'Элемент пропущен, поскольку для некоторой категории не найдена привязка к категории';
$_['info_col_binding_skip_empty'] = 'Элемент пропущен, поскольку к этому товару не привязана ни одна категория';

// Step 4
$_['text_simu_summary'] = 'Сводка моделирования (10 строк):';
$_['text_full_simu_summary'] = 'Полный отчет о моделировании:';
$_['text_item_to_update'] = 'Элемент для обновления';
$_['entry_row_status'] = 'Действие';
$_['text_simu_inserted'] = 'Вставить';
$_['text_simu_updated'] = 'Обновить';
$_['text_simu_disabled'] = 'Отключить';
$_['text_simu_qtyzero'] = 'Установить количество равным нулю';
$_['text_simu_deleted'] = 'Удалить';
$_['text_simu_skipped'] = 'Пропустить';
$_['text_simu_error'] = 'Ошибка';
$_['text_nav_start'] = 'Начало файла';
$_['text_nav_prev'] = 'Предыдущие 10 строк';
$_['text_nav_next'] = 'Следующие 10 строк';
$_['text_nav_end'] = 'Конец файла';
$_['text_nav_custom'] = 'Установите начальную строку и нажмите Enter';

// Step 5
$_['text_import_label'] = 'Импортировать метку';
$_['text_import_label_i'] = 'Дайте имя этому сеансу импорта, тогда в списке продуктов вы сможете фильтровать продукты, которые были импортированы на этот раз. Оставьте пустым, чтобы не менять метку импорта, если она существует.';
$_['text_process_summary'] = 'Сводка процесса';
$_['text_rows_csv'] = 'Всего строк в файле';
$_['text_rows_process'] = 'Всего строк для обработки';
$_['text_rows_insert'] = 'Всего строк для вставки';
$_['text_rows_update'] = 'Всего строк для обновления';
$_['text_process_done'] = 'Состояние процесса';
$_['text_rows_processed'] = 'Обработано';
$_['text_rows_inserted'] = 'Вставлено';
$_['text_rows_updated'] = 'Обновлено';
$_['text_rows_disabled'] = 'Отключено';
$_['text_rows_qtyzero'] = 'Установить количество равным нулю';
$_['text_rows_deleted'] = 'Удалено';
$_['text_rows_skipped'] = 'Пропущено';
$_['text_rows_error'] = 'Ошибка';
$_['text_empty_line_skip'] = 'Пустая строка';
$_['entry_color_scheme'] = 'Цветовая схема:<span class="help">Быстрый доступ к некоторым цветовым схемам, редактирование их на вкладке "Дизайн"</span>';
$_['entry_logo'] = 'Логотип:';
$_['entry_feed_title'] = 'Имя:';
$_['entry_cache_delay'] = 'Задержка кэширования:<span class="help">Сколько времени отображать сгенерированный файл до повторной генерации?</span>';
$_['entry_language'] = 'Язык:<span class="help"></span>';
$_['entry_feed_url'] = 'URL фида данных:<span class="help">Передайте этот URL целевой службе</span>';
$_['entry_additional_image'] = 'Дополнительные изображения';
$_['text_no_change'] = '- Без изменений -';
$_['text_on'] = 'Вкл';
$_['text_off'] = 'Выкл';

// File format
$_['text_format_csv'] = 'CSV';
$_['text_format_xml'] = 'XML';
$_['text_format_xls'] = 'XLS';
$_['text_format_xlsx'] = 'XLSX';
$_['text_format_sql'] = 'SQL';
$_['text_format_odt'] = 'ODT';
$_['text_format_ods'] = 'ODS';
$_['text_format_json'] = 'JSON';
$_['text_format_pdf'] = 'PDF';
$_['text_format_html'] = 'HTML';
$_['text_format_txt'] = 'TXT';
$_['text_format_tsv'] = 'TSV';

// Export
$_['text_tab_1'] = 'Экспорт';
$_['entry_export_type'] = 'Тип экспорта';
$_['entry_backup_tables'] = 'Таблицы базы данных для экспорта';
$_['entry_truncate'] = 'Очистить таблицу перед вставкой';
$_['entry_truncate_i'] = 'Это добавит инструкцию усечения для очистки любых данных в вашей таблице перед вставкой новых элементов; если она отключена, данные будут добавлены к существующим';
$_['entry_sql_prefix'] = 'Изменить префикс таблицы';
$_['entry_sql_prefix_i'] = 'Если целевая база данных имеет другой префикс, вы можете изменить его здесь или установить пустым, если префикс не используется';
$_['entry_export_type_i'] = 'Какие данные вы хотите экспортировать?';
$_['entry_export_format'] = 'Формат экспорта';
$_['entry_export_format_i'] = 'Выберите формат выходного файла';
$_['text_start_export'] = 'Создать файл экспорта';
$_['export_all'] = '- Все -';
$_['export_all_filters'] = 'Все фильтры';
$_['export_product_filters'] = 'Фильтры товаров';
$_['export_all_attributes'] = 'Все атрибуты';
$_['export_product_attributes'] = 'Атрибуты продукта';
$_['text_csv_settings'] = 'Настройки CSV';
$_['режим'] = 'Режим';
$_['entry_export_condition'] = 'Условие';
$_['entry_export_condition_i'] = 'Экспортируйте только те данные, которые соответствуют следующим условиям: первое поле - это имя поля, как оно есть в базе данных; если таблица не содержит такого поля, оно будет игнорироваться';

// Export filters
$_['export_filters'] = 'Фильтры';
$_['total_export_items'] = 'Всего элементов для экспорта:';
$_['filter_name'] = 'Имя';
$_['filter_model'] = 'Модель';
$_['filter_model_i'] = 'Установите различные, используя | знак трубки';
$_['filter_tag'] = 'Тег';
$_['filter_tag_i'] = 'Это работает только при выборе языка для экспорта';
$_['filter_language'] = 'Язык';
$_['filter_manufacturer'] = 'Производитель';
$_['filter_manufacturer_i'] = 'Вы можете выбрать нескольких производителей, начните вводить текст, чтобы быстро найти производителя';
$_['filter_label'] = 'Импортировать ярлык';
$_['filter_category'] = 'Категория';
$_['filter_category_i'] = 'Вы можете выбрать несколько категорий, начать вводить текст, чтобы быстро найти свою категорию, подкатегории включаются автоматически';
$_['filter_interval'] = 'Интервал времени';
$_['filter_interval_i'] = 'Экспортировать только те элементы, дата которых находится в пределах временного интервала. Нажмите на значок ниже, чтобы просмотреть дополнительную информацию о доступных форматах';
$_['filter_store'] = 'Магазин';
$_['filter_status'] = 'Статус';
$_['filter_price'] = 'Цена';
$_['filter_quantity'] = 'Количество';
$_['filter_quantity_i'] = 'Минимальное количество для экспорта продукта';
$_['filter_limit'] = 'Лимит';
$_['filter_limit_i'] = 'Ограничить количество экспортируемых элементов. Начало: начать экспорт с этого элемента. - Ограничить: количество экспортируемых элементов';
$_['filter_order_id'] = 'Идентификатор заказа';
$_['filter_order_status'] = 'Статус заказа';
$_['filter_order_status_i'] = 'Если ничего не выбрано, будут экспортированы все статусы заказов, кроме отсутствующих заказов';
$_['filter_customer'] = 'Клиент';
$_['filter_customer_group'] = 'Группа клиентов';
$_['filter_date_added'] = 'Дата добавления';
$_['filter_date_modified'] = 'Дата изменения';
$_['filter_total'] = 'Итого';
$_['filter_limit_start'] = 'Начать';
$_['filter_limit_limit'] = 'Лимит';
$_['filter_start'] = 'Начать';
$_['filter_end'] = 'Конец';
$_['filter_min'] = 'Мин';
$_['filter_max'] = 'Макс';
$_['text_missing_orders'] = 'Отсутствующие заказы';

// Export options
$_['export_options'] = 'Параметры';
$_['export_fields'] = 'Поля экспорта';
$_['export_fields_i'] = 'Выберите, какие поля вы хотите иметь в файле экспорта';
$_['param_price_multiplier'] = 'Множитель цены';
$_['param_price_multiplier_i'] = 'Измените цену, отображаемую в файле экспорта, например установите 1,12, чтобы добавить 12% к исходной цене';
$_['param_date_format'] = 'Формат даты';
$_['param_date_format_i'] = 'Экспортируйте дату в выбранном вами формате. Проверьте функцию даты PHP, чтобы увидеть все доступные форматы';
$_['param_image_inline'] = 'Отображение изображения';
$_['param_image_inline_i'] = 'Как вы хотите, чтобы поля изображения отображались в выходном файле?';
$_['param_image_path'] = 'Режим пути к изображению';
$_['param_image_path_i'] = 'Используйте полный URL-адрес, чтобы получить полный URL-адрес вашего изображения — относительный путь Opencart следует использовать только в том случае, если вы будете использовать этот экспорт на том же веб-сайте';
$_['image_path_relative'] = 'Относительный путь Opencart';
$_['image_path_absolute'] = 'Полный URL';
$_['param_option_row'] = 'Строки элементов';
$_['param_option_row_i'] = 'Если вы выбираете для каждого продукта, вы можете использовать поле экспорта Product_option, если вы используете режим для каждого параметра, используйте каждое поле option_x';
$_['text_option_row_default'] = 'Для каждого продукта — каждый продукт генерирует одну строку';
$_['text_option_row_option'] = 'Для каждого параметра — каждый параметр генерирует одну строку';
$_['text_image_inline'] = 'Все в одном поле';
$_['text_image_inline_cols'] = 'Каждое в отдельном поле (image_1, image_2, ...)';

// Configuration
$_['text_tab_2'] = 'Параметры';
$_['tab_option_1'] = 'Производительность';
$_['tab_option_2'] = 'Задания Cron';
$_['tab_option_3'] = 'Основные параметры';
$_['entry_default_import_label'] = 'Метка импорта по умолчанию';
$_['default_label_i'] = 'Установите здесь метку по умолчанию для вашего сеанса импорта. Это поможет вам легко фильтровать продукты, импортированные в определенный сеанс, в списке продуктов.<br/><br/>Вы можете использовать эти теги: <code>[профиль] [день] [месяц] [год]</code>';
$_['entry_batch_import'] = 'Номер пакета импорта';
$_['entry_batch_export'] = 'Номер пакета экспорта';
$_['entry_sleep'] = 'Задержка процесса';
$_['batch_import_i'] = '<h4>Номер пакета</h4><p>Выберите количество элементов, обрабатываемых по каждому запросу. Настройте этот параметр, чтобы улучшить производительность импорта/экспорта.<br/>Большое число может ускорить процесс. время обработки, но слишком большое количество может привести к сбою в зависимости от ресурсов вашего сервера.</p><p>Это <b>не</b> максимальное количество элементов, которые вы можете импортировать, это просто количество обработанных элементов. в одном запросе, но модуль продолжает отправлять запросы до тех пор, пока весь ваш фид не будет обработан. Не устанавливайте здесь значения выше 1000, рекомендуется от 50 до 300 (по умолчанию 200).</p><p><b>Страница входа появляется во время импорта.</b><br/>Если у вас появляется страница входа. во время импорта это может быть вызвано слишком большим номером пакета импорта. Попробуйте установить меньшее число, чтобы избежать этой проблемы.</p><h4 style="margin-top:20px">Задержка процесса</h4>< p>Импорт и экспорт используют очень большое количество ресурсов с сервера, на общем хосте или низкопрофильном сервере могут использоваться почти все ресурсы, и тогда ваш веб-сайт может быть недоступен во время процесса.<br/>Параметр задержки позволяет вам подождите несколько раз перед обработкой каждого элемента, на этот раз освободится некоторый ресурс, чтобы сервер немного передохнул и обработал другие запросы.<br/>Число указано в миллисекундах, что означает 1000 мс = 1 секунда, рекомендуемая настройка от От 5 до 50 (по умолчанию 0).<br/>Имейте в виду, что большое значение этого параметра значительно увеличит время процесса импорта.</p>';

// Car Shop
$_['entry_carshop_method_'] = 'Обновление по прямым данным';
$_['entry_carshop_method_by_id'] = 'Обновить путем импорта данных из таблицы списка деталей';
$_['entry_carshop_type'] = 'Тип';
$_['entry_carshop_year_start'] = 'Начало года';
$_['entry_carshop_year_end'] = 'Конец года';
$_['entry_carshop_make'] = 'Сделать';
$_['entry_carshop_model'] = 'Модель';
$_['entry_carshop_engine'] = 'Двигатель';
$_['import_carshop'] = 'Импорт автозапчастей';
$_['text_type_carshop'] = 'Автомобильные запчасти';
$_['text_type_car_shop'] = 'Автомобильные запчасти';
$_['import_all_car_shop'] = 'Импортировать в список деталей (необязательно)';
$_['import_product_car_shop'] = 'Импортировать в товары';
$_['text_import_carshop_product'] = 'Импортируйте автомобильные детали в свои продукты';
$_['text_import_carshop_list'] = 'Импортируйте автомобильные детали в список автомобильных запчастей. Затем вы можете использовать этот список в качестве источника для импорта данных об автомобильных запчастях в свои продукты, просто выбрав идентификатор списка автомобильных запчастей.<br/>Используйте только это Если у вас есть файл импорта без всех данных внутри, если у вас уже есть все данные о деталях, выберите на шаге 2 > Существующий идентификатор товара идентификатор продукта, чтобы напрямую импортировать данные о запчастях автомобиля в ваши продукты.';
$_['entry_carshop_list_id'] = 'Идентификатор списка автомобильных запчастей';

// Cron
$_['text_tab_cron_config'] = 'Конфигурация';
$_['text_tab_cron_import'] = 'Импортировать';
$_['text_tab_cron_export'] = 'Экспорт';
$_['text_tab_cron_report'] = 'Отчет';
$_['text_cli_log_save'] = 'Сохранить файл журнала';
$_['text_cli_clear_logs'] = 'Очистить журналы';
$_['entry_cron_key'] = 'Безопасный ключ';
$_['entry_cron_key_i'] = 'Определите свой собственный безопасный ключ, его необходимо включить в команду cron';
$_['entry_report_email'] = 'Импортировать адрес электронной почты с отчетом';
$_['entry_report_email_i'] = 'Отправьте сводную информацию о процессе импорта на электронную почту администратора. Если вы хотите изменить целевой адрес электронной почты, установленный в команде cron, параметр email=';
$_['entry_cron_command'] = 'Команда Cron';
$_['text_cron_label'] = 'Установите метку импорта (если она не определена, будет использоваться метка профиля или метка по умолчанию):';
$_['text_cron_export_filename'] = 'Имя файла экспорта (если не указано, оно будет использоваться в качестве типа и даты экспорта):';
$_['text_cron_export_email'] = 'Отправить файл экспорта на электронную почту (это будет работать только для файлов небольшого размера):';
$_['text_cron_import_email'] = 'Отправить сводку импорта на электронную почту (переопределить адрес электронной почты администратора, если включен адрес электронной почты для отчетов):';
$_['entry_cron_params'] = 'Дополнительные параметры';
$_['entry_cron_command_i'] = 'Это команда, которую вам придется вводить в ваши задания cron (если путь к php определен неправильно, спросите у администратора вашего сервера, какой путь к php, обычно это /usr/ bin/php, /usr/local/bin/php, /usr/local/cpanel/3rdparty/bin/php, ...)';
$_['entry_cron_params_i'] = 'Эти параметры не являются обязательными, вы можете добавить параметр после основной команды, добавить пробел между каждым параметром';
$_['cron_jobs_i'] = 'Вы можете автоматически запускать предопределенные профили с помощью заданий cron.<br/><br/>Все, что вам нужно сделать, это определить профиль, изменив все настройки на первой вкладке, а затем сохранить это на шаге 4. Укажите точное имя вашего профиля в конце команды.<br/>Будет создан отчет, чтобы вы могли проконсультироваться здесь, если все прошло хорошо.<br/><br/>Обратите внимание на cron Задания работают только с файлами по URL-адресу, FTP или локальному пути, а не с загруженными файлами, предназначенными для мгновенного использования.<br/><br/><b>Настройте задания cron:</b><ol><li >Перейдите на вкладку «Импорт» и выберите файл для работы. Вы должны использовать файл по URL-адресу, FTP или локальному пути.</li><li>Настройте свой фид с нужными вам параметрами, перейдите к шагу 4.</li> <li>На шаге 4 сохраните свой профиль.</li><li>Зайдите в cPanel или в администрацию сервера, чтобы настроить задание cron.</li><li>Скопируйте нужную команду ниже (не забудьте изменить имя профиля на ваше)</li><li>Готово, ваш cron запустится на основе ваших параметров, и вы сможете проверить, все ли в порядке, на вкладке отчета.</li></ol>< p><b>Как настроить cron в администраторе вашего сервера:</b></p><ul><li>cPanel: <a target="_blank" href="https://blog.cpanel.com /how-to-configure-a-cron-job/">Документация</a> – <a target="_blank" href="https://www.youtube.com/watch?v=YwpUjz1tMbA">Видеоруководство </a></li><li>Plesk: <a target="_blank" href="https://support.plesk.com/hc/en-us/articles/115003121073-How-to-add-a -scheduled-task-in-Plesk-UI-using-crontab-syntax-">Документация</a> – <a target="_blank" href="https://www.youtube.com/watch?v=ur1_ua9TMXs ">Видеоурок</a></li></ul>';
$_['text_process_time'] = 'Общее время процесса:';
$_['text_hours'] = 'часы';
$_['text_минуты'] = 'минуты';
$_['text_секунды'] = 'секунды';
$_['entry_cron_log'] = 'Тип отчета';
$_['entry_cron_log_i'] = 'Выберите, какой отчет вы хотите получить.';
$_['text_log_all'] = 'Полный — регистрировать все данные об импортированных элементах';
$_['text_log_error'] = 'Ошибка — вставлять журнал только при наличии ошибки';
$_['text_log_off'] = 'Отключено — ничего не регистрировать';
$_['text_cron_command_format'] = 'Некоторым серверам не нравятся двойные кавычки " в команде cron. Если команда не работает, попробуйте заменить ее одинарными кавычками \'';

$_['text_tab_about'] = 'О программе';

// Warnings
$_['предупреждение'] = 'Предупреждение';
$_['warning_category_id'] = 'Идентификатор категории не найден.';
$_['warning_discount_format'] = 'Неверный формат скидки, формат должен быть следующим: <b>&lt;customer_group_id&gt;:&lt;quantity&gt;:&lt;priority&gt;:&lt;price&gt;:&lt;date_start&gt;:&lt;date_end&gt;< /b>, эта скидка не будет добавлена к товару';
$_['warning_discount_not_numeric'] = 'Неверный формат скидки, цена не является числовой, эта скидка не будет добавлена к товару';
$_['warning_remote_image_not_found'] = 'Удаленное изображение не найдено: ';
$_['warning_store_not_found'] = 'Магазин не найден: <b>%s</b>, убедитесь, что имя магазина существует';
$_['warning_layout_not_found'] = 'Макет не найден: <b>%s</b>, убедитесь, что тип макета существует';

// Entry
$_['entry_status'] = 'Статус:';

// Message
$_['text_skip_insert'] = 'Действие при создании нового элемента настроено на пропуск новых элементов';
$_['text_skip_update'] = 'Действие существующего элемента настроено на пропуск существующих элементов';
$_['text_skip_quick_update'] = 'Идентификатор не найден в вашей базе данных';
$_['text_skip_delete'] = 'Элемент для удаления не существует';
$_['text_insert_option'] = 'Добавить опцию';
$_['text_skip_option_not_found'] = 'Пропущено, поскольку опция не найдена';
$_['text_skip_product_not_found'] = 'Пропущено, поскольку соответствующий продукт не найден';
$_['text_skip_option_no_product'] = 'Строка опций пропущена, поскольку соответствующий продукт не найден';
$_['text_skip_option_no_option'] = 'Строка опций пропущена, поскольку опция не найдена';

// Info
$_['info_title_default'] = 'Помощь';
$_['info_msg_default'] = 'Раздел справки по этой теме не найден';
$_['info_soft_update_mode'] = 'Режим сохранения обновления: будут обновляться только отображаемые поля.';
$_['current_server_path'] = 'Это путь к вашему корневому каталогу opencart: ';
$_['text_filter_group'] = 'Группа фильтров';
$_['text_filter_name'] = 'Имя фильтра';
$_['info_filter_title'] = 'Расширенный импорт фильтров';
$_['info_filter_xml'] = '
<p>Например, у вас есть такой массив:<br/>
<code style="white-space:pre">'.print_r(array('0'=> array('groupEn' => 'Группа фильтров', 'nameEn' => 'Имя фильтра')), true). '</code></p>
<p>В таком случае определите основной фильтр так, чтобы он соответствовал полю, содержащему массив значений, и в конкретных параметрах ниже установите для группы фильтра значение <b>groupEn</b>, а для имени фильтра значение <b>nameEn</b>.< /р>';
$_['entry_attr_mode'] = 'Режим обнаружения';
$_['entry_attr_mode_i'] = 'Выберите, как определять атрибуты, если у вас есть несколько двоеточий.';
$_['text_attr_mode_default'] = 'По умолчанию';
$_['text_attr_mode_1'] = '2 значения - если a:b:c обнаруживает имя a, значение b:c';
$_['text_attr_mode_2'] = '3 значения - если a:b:c:d обнаруживает группу a, имя b, значение c:d';
$_['text_download_value'] = 'Загрузить значение';
$_['text_attribute'] = 'Атрибут';
$_['text_attribute_group'] = 'Группа атрибутов';
$_['text_attribute_name'] = 'Имя атрибута';
$_['text_attribute_value'] = 'Значение атрибута';
$_['info_attributes_title'] = 'Импорт атрибутов';
$_['info_downloads_xml_title'] = 'Дополнительные параметры для массива значений';
$_['info_downloads_xml'] = '
<h4>Случай 1</h4>
<p>Например, у вас есть такой массив:<br/>
<code style="white-space:pre">'.print_r(array('0'=> array('name' => 'some-file.pdf', 'value' => array('url' => 'http://remote/some-file.pdf'))), true).'</code></p>
<p>В таком случае определите основные файлы загрузки так, чтобы они соответствовали полю, содержащему массив значений, и в определенных параметрах ниже установите для значения загрузки значение <b>value/url</b>.</p>
';
$_['info_attributes_xml_title'] = 'Дополнительные параметры для массива значений';
$_['info_attributes'] = '
<p>Можно форматировать различными способами:
<ul><li>имя_группы_атрибутов:имя_атрибута:значение</li>
<li>имя_атрибута:значение</li>
<li>значение (заголовок используется как имя атрибута)</li>
<li>&lt;ul&gt;&lt;li&gt;имя группы: значение&lt;/li&gt;&lt;/ul&gt;</li>
<li>&lt;table&gt;&lt;tr&gt;&lt;td&gt;имя группы&lt;/td&gt;&lt;td&gt;значение&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;</li></ul></ р>
<p>Группа и атрибут создаются автоматически, если они не существуют. Если атрибут не существует и группа не определена, он автоматически назначается группе «По умолчанию».</p>';
$_['info_attributes_xml_title'] = 'Дополнительные параметры для массива значений';
$_['info_attributes'] = '
<p>Можно форматировать различными способами:
<ul><li>имя_группы_атрибутов:имя_атрибута:значение</li>
<li>имя_атрибута:значение</li>
<li>значение (заголовок используется как имя атрибута)</li>
<li>&lt;ul&gt;&lt;li&gt;имя группы: значение&lt;/li&gt;&lt;/ul&gt;</li>
<li>&lt;table&gt;&lt;tr&gt;&lt;td&gt;имя группы&lt;/td&gt;&lt;td&gt;значение&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;</li></ul></ р>
<p>Группа и атрибут создаются автоматически, если они не существуют. Если атрибут не существует и группа не определена, он автоматически назначается группе «По умолчанию».</p>';
$_['info_attributes_xml'] = '
<h4>Случай 1</h4>
<p>Например, у вас есть такой массив:<br/>
<code style="white-space:pre">'.print_r(array('0'=> array('name' => 'Attribute name', 'value' => array('val' => 'Attribute value'))), true).'</code></p>
<p>В таком случае определите основной атрибут так, чтобы он соответствовал полю, содержащему массив значений, и в определенных параметрах ниже установите для имени атрибута значение <b>name</b>, а для значения атрибута — <b>value/val</b> .</p>
<h4>Случай 2</h4>
<p>XML в формате:<br/>
<code style="white-space:pre">&lt;attributes имя_атрибута_1="значение_атрибута_1" имя_атрибута_2="значение_атрибута_2"&gt;&lt;/attribute&gt;</code></p>
<p>Задайте для атрибута значение <b>атрибуты</b> и поместите ключевое слово [attributes] в <b>имя атрибута</b></p>
<h4>Случай 3</h4>
<p>XML в формате:<br/>
<code style="white-space:pre"> &lt;param name=&quot;Имя атрибута 1&gt;Значение атрибута 1&lt;/param&gt;
   &lt;param name=&quot;Имя атрибута 2&quot;&gt;Значение атрибута 2&lt;/param&gt;
</code></p>
<ul>
  <li>Установить атрибут <b>param</b></li>
   <li>Задайте для имени атрибута значение <b>param@name</b></li>
   <li>Установите значение атрибута <b>[current]</b> (при этом будет получено текущее значение, установленное в основном атрибуте)</li>
</ul>
';
$_['info_options_title'] = 'Импорт опций';
$_['info_special_title'] = 'Импорт по специальной цене';
$_['info_discount_title'] = 'Импорт цен со скидкой';
$_['info_special_advanced_title'] = 'Расширенный импорт специальных цен';
$_['info_options_advanced_title'] = 'Дополнительные параметры для импорта опций';
$_['info_discount_advanced_title'] = 'Дополнительные параметры для импорта скидок';
$_['info_options_xml_title'] = 'Дополнительные параметры для массива значений (импорт XML)';
$_['info_options']		= '
<p>Can be formatted in various ways:
<ul>
<li>значение (имя — это имя заголовка или узла, тип автоматически устанавливается для выбора, если опция не существует)</li>
<li>имя: значение (тип устанавливается автоматически, если опция не существует)</li>
<li>тип: имя: значение</li>
<li>тип: имя: значение: цена</li>
<li>тип: имя: значение: цена: количество</li>
<li>тип: имя: значение: цена: количество: вычесть</li>
<li>тип: имя: значение: цена: количество: вычесть: вес</li>
<li>тип: имя: значение: цена: количество: вычесть: вес: требуется</li></ul></p>
<p><b>Особый формат</b><br/>Если ваш параметр не отформатирован ни в одном из предыдущих форматов, вы можете использовать параметр «Формат строки параметра», чтобы выбрать порядок ваших параметров, например, если вы иметь такое значение: количество, затем выберите в строковом формате значение и количество.<br/>Если ваши значения разделены другим символом, кроме двоеточия, вы можете использовать дополнительную функцию «разделитель нескольких значений», чтобы установить хороший разделитель.<br/> <br/>Вы также можете установить некоторые значения по умолчанию в полях дополнительных параметров на случай, если у вас нет всех доступных значений.</p>
<p>Параметры и значения параметров создаются автоматически, если они не существуют.</p>
';
$_['info_options_advanced'] = '
<p><b>Отдельные поля для параметров</b><br/>Если ваши параметры расположены в отдельных полях, оставьте основное поле параметров пустым и нажмите «Получить поля дополнительных параметров», чтобы иметь возможность установить их отдельно.< /п>
<p><b>В вашем файле импорта параметры заданы в виде новой строки.</b><br/>Затем настройте поля дополнительных параметров, как описано здесь, и перейдите на вкладку «Дополнительные функции», чтобы добавить функцию «Опция продукта». " чтобы указать, как идентифицировать строку параметров.';
$_['info_options_xml'] = '
<p>Например, у вас есть такой массив:<br/>
<code style="white-space:pre">'.print_r(array('0'=> array('name' => 'Option name', 'value' => array('val' => 'Option value'))), true).'</code></p>
<p>В таком случае определите основную опцию так, чтобы она соответствовала полю, содержащему массив значений, и в определенных параметрах ниже установите для имени опции значение <b>name</b>, а для значения опции — <b>value/val</b> .<br/>
Если у вас есть несколько полей значений и значения могут находиться в одном или другом поле, вы можете определить проверку в обоих полях, используя | чтобы разделить их, например: field1|field2</p>
<p><b>Поля SKU и UPC</b><br/>Эти поля будут работать только в том случае, если для их обработки установлено специальное расширение. В зависимости от расширения эта настройка может работать только в режиме «Замена обновления», а не в режиме «Сохранение обновления».</p>';
$_['info_special'] = '
<p>Можно форматировать различными способами:
<ul>
<li>цена</li>
<li>customer_group_id: цена</li>
<li>customer_group_id: приоритет: цена</li>
<li>customer_group_id: приоритет: цена: дата_конец</li>
<li>customer_group_id: приоритет: цена: дата_начало: дата_конец</li>
</ul></p>
<p>Дата окончания по умолчанию не ограничена.</p>';
$_['info_discount'] = '
<p>Можно форматировать различными способами:
<ul>
<li>цена</li>
<li>цена: date_end</li>
<li>цена: дата_начало: дата_конец</li>
<li>количество: цена: дата_начало: дата_конец</li>
<li>customer_group_id: количество: цена: дата_начало: дата_конец</li>
<li>customer_group_id: приоритет: количество: цена: date_start: date_end</li>
</ul></p>
<p>Дата окончания по умолчанию не ограничена.</p>';
$_['info_discount_advanced']		= '
<p><b>Отдельные поля для скидки</b><br/>Если ваши параметры расположены в отдельных полях, оставьте основное поле параметра пустым и нажмите «Заполнить поля ниже», чтобы установить каждое из них отдельно.</p> ';
$_['info_special_advanced'] = '
<h5>Работа с разделенными полями</h5>
<p>Если ваши параметры расположены в отдельных полях, оставьте основное поле параметров пустым и нажмите «Заполнить поля ниже», чтобы задать каждое из них отдельно.</p>
<h5>Настроить даты по умолчанию</h5>
Если даты начала/окончания не указаны в вашем файле, вы можете установить здесь некоторые даты по умолчанию. Вы можете установить различные записи для получения определенного результата. Некоторые примеры см. в таблице ниже.</p>
<p><b>Примеры формата даты</b></p>
<table class="table">
  <tr><td><b>10.12.2020</b></td><td>конкретная дата в американском формате (10 декабря 2020 г.)</td></tr>
   <tr><td><b>12-10-2020</b></td><td>конкретная дата в формате ЕС (10 декабря 2020 г.)</td></tr>
   <tr><td><b>10 декабря 2020 г.</b></td><td>конкретная дата в формате SQL (10 декабря 2020 г.)</td></tr>
   <tr><td><b>10 декабря 2020 г.</b></td><td>конкретная дата в текстовом формате</td></tr>
   <tr><td><b>+3 дня</b></td><td>3 дня с текущей даты</td></tr>
   <tr><td><b>+1 месяц</b></td><td>1 месяц с текущей даты</td></tr>
   <tr><td><b>на следующей неделе</b></td><td>на следующей неделе с текущей даты</td></tr>
   <tr><td><b>в следующее воскресенье</b></td><td>в следующее воскресенье с текущей даты</td></tr>
   <tr><td><b>первый день следующего месяца</b></td><td>первый день следующего месяца</td></tr>
</table>';

// info
$_['info_help'] = 'Контекстная справка: нажмите на раздел, чтобы получить дополнительную информацию';
$_['info_data_source_title'] = 'Источник данных';
$_['info_data_source'] = '<h4>Источник данных</h4>
<p>На этом этапе вы выбираете тип данных, которые хотите импортировать, и источник данных. Получить данные можно различными способами.</p>
<table class="table">
   <tr><td style="border:0"><b>Загрузка файла</b></td><td style="border:0">Используйте это, чтобы загрузить файл, который есть на вашем компьютере, просто перетащите и перетащите файл в зону сброса или щелкните его, чтобы выбрать файл для загрузки.</td></tr>
   <tr><td><b>URL</b></td><td>Если файл находится на удаленном сервере, доступном по URL, используйте этот режим, это также работает для Dropbox, Google Drive и большей части облачного хранилища. услуги.</td></tr>
   <tr><td><b>API</b></td><td>Подключитесь к API. Подробную информацию об использовании см. в специальном разделе справки.</td></tr>
   <tr><td><b>FTP</b></td><td>Получите файл через FTP или SFTP, «свяжите» составленный URL-адрес ftp с протоколом (ftp:// или sftp:/ /), пользователь и пароль, разделенные двоеточием, и URL-адрес сервера @. В параметре пути к файлу укажите точный путь к вашему файлу.</td></tr>
   <tr><td><b>Локальный путь</b></td><td>Если файл доступен на вашем собственном сервере, вы можете использовать этот режим, в этом случае предпочтите этот режим, а не ftp или URL, потому что так модуль будет напрямую использовать файл, а не загружать его.</td></tr>
</table>
<h4>Сжатие и расширение</h4>
<p>Модуль попытается автоматически определить сжатие и расширение файла. В случае неудачи вы можете принудительно установить эти параметры, просто выбрав соответствующий в списке.</p>
';
$_['info_profiles_title'] = 'Как использовать профили?';
$_['info_profiles'] = '<h4>Как использовать профили?</h4>
<p>Профили позволяют вам сохранять конфигурацию импорта, поэтому вам не нужно каждый раз настраивать все, что вам нужно, они также позволяют вам настроить задание cron для периодического автоматического запуска вашего профиля импорта.</p> р>
<h5>Создать профиль</h5>
<ul>
   <li>Загрузите файл и установите все необходимые настройки</li>
   <li>Перейдите к шагу 4, чтобы проверить, все ли в порядке.</li>
   <li>На шаге 4 нажмите кнопку <span class="gkd-badge"><i class="fa fa-save"></i> Сохранить профиль</span></li>
   <li>Дайте имя своему профилю и сохраните его.</li>
</ul>

<h5>Загрузить профиль</h5>
<p>После того как вы сохранили профиль, вы сможете загрузить его на шаге 1. Для этого просто выберите его, вы увидите, что настройки источника файла будут автоматически обновлены с учетом того, что вы сохранили в своем профиле, затем просто продолжайте. через следующие шаги.</p>
<p>Если вы выбрали режим загрузки файла, вам придется повторно загрузить файл, все остальные режимы импорта получат файл автоматически.</p>

<h5>Изменить профиль</h5>
<ul>
   <li>Чтобы редактировать профиль, просто загрузите свой профиль в обычном режиме.</li>
   <li>Измените любые настройки на шагах 1–3.</li>
   <li>На шаге 4 нажмите кнопку <span class="gkd-badge"><i class="fa fa-save"></i> Сохранить профиль</span>, чтобы обновить текущий профиль</li>
</ul>

<h5>Создать новый профиль на основе настроек другого профиля</h5>
<ul>
   <li>Загрузите исходный профиль на шаге 1.</li>
   <li>Измените любые настройки на шагах 1–3.</li>
   <li>На шаге 4 нажмите кнопку <span class="gkd-badge"><i class="fa fa-save"></i> Сохранить профиль</span></li>
   <li>Измените имя профиля, чтобы сохранить его в новом профиле.</li>
</ul>

<h5>Удалить профиль</h5>
<ul>
   <li>Выберите профиль на шаге 1.</li>
   <li>Нажмите кнопку <span class="gkd-badge"><i class="fa fa-minus-circle"></i></span>, чтобы удалить его.</li>
</ul>

<h5>Создайте резервную копию своих профилей</h5>
<ul>
   <li>Чтобы сделать резервную копию вашего профиля, вам просто нужно сохранить папку /admin/view/universal_import/profiles/ на FTP.</li>
   <li>Вы можете восстановить их в той же папке.</li>
</ul>
';
$_['info_api_title'] = 'Импортировать по API';
$_['info_api'] = '<h4>Импорт по API</h4>
<p>Импорт API — это мощный инструмент, но его немного сложно настроить, а также из-за сложности некоторых API может потребоваться некоторая адаптация модуля, чтобы заставить модуль работать с ними, если у вас сложный API, который вам не удалось справиться, вы можете связаться с нами, мы можем сделать конфигурацию индивидуальной.</p>
<h5>Логин или ключ API</h5>
<p>Укажите в этом поле данные, необходимые для подключения к вашему API. Различные возможности см. в таблице ниже:</p>
<table class="table">
   <tr><td style="border:0"><b>пользователь:пароль</b></td><td style="border:0">Основной вход</td></tr>
   <tr><td><b>POST|user:user|pass:pass</b></td><td>Войти в режим POST с параметрами user и pass</td></tr>
   <tr><td><b>GET|user:user|pass:pass</b></td><td>Войти в режим GET с параметрами user и pass</td></tr>
   <tr><td><b>HEAD|key</b></td><td>Установить ключ API в заголовки запроса</td></tr>
</table>

<h5>URL-адрес аутентификации (необязательно)</h5>
<p>Если ваш API требует подключения к URL-адресу аутентификации перед доступом к определенному URL-адресу для получения некоторых данных, используйте это поле для настройки URL-адреса аутентификации, данные для входа в систему для подключения к этому URL-адресу — это те, которые установлены в <i> Поле для входа или API</i></p>

<h5>API</h5>
<p>Укажите здесь URL-адрес, по которому будут получены данные импорта. Обратите внимание, что при использовании API обычно необходимо установить определенный формат файла вместо использования режима автоматического определения. Формат API обычно – XML или JSON.</p>

<h5>Пример</h5>
<table class="table">
   <tr><td style="border:0"><b>API входа или ключа:</b></td><td style="border:0">POST|user:test|pass:123456</ тд></tr>
    <tr><td><b>URL-адрес аутентификации:&nbsp;&nbsp;&nbsp;</b></td><td>https://api/v1/login</td></tr>
    <tr><td><b>API:</b></td><td>https://api/v1/product&format=xml</td></tr>
</table>
';
$_['info_identifier_title'] = 'Определите свои данные';
$_['info_identifier'] = '<h4>Определите свои предметы</h4>
<p>При импорте данных важно иметь возможность правильно идентифицировать любой существующий элемент, чтобы модуль мог знать, нужно ли ему вставить новый элемент или просто обновить существующий; модуль сделает это на основе настроек в этом разделе. </p>
<h5>Существующий идентификатор элемента</h5>
<p>Укажите в этом параметре, какое поле вы хотите использовать для идентификации вашего товара. У вас должен быть уникальный идентификатор. Обычно это нормально для модели, но в некоторых данных импорта это поле может быть недоступно, поэтому, если у вас есть SKU или EAN, то вы можете использовать его соответственно своим фактическим данным импорта.</p>
<h5>Действие по созданию нового элемента</h5>
<p>Если идентификатор не совпадает с реальным товаром в вашей опенкарте, модуль выполнит действие этого параметра</p>
<table class="table">
   <tr><td style="border:0"><b>Вставить</b></td><td style="border:0">Элемент не существует, поэтому создайте новый элемент</td></ тр>
   <tr><td><b>Пропустить</b></td><td>Элемент не существует, но не создавайте новый элемент, может быть полезно, если вы хотите только обновить элементы</td></tr >
</table>
<h5>Существующее действие с элементом</h5>
<p>Если идентификатор совпадает с реальным товаром в вашей открытой карте, модуль выполнит действие этого параметра</p>
<table class="table">
   <tr><td style="border:0"><b>Обновить – сохранить</b></td><td style="border:0">Элемент существует, обновите его, указав поле, выбранное на шаге 3, поля оставленное пустым останется без изменений</td></tr>
   <tr><td><b>Обновить - заменить</b></td><td>Элемент существует, обновите его, заменив все данные элемента, элемент будет полностью сброшен, поэтому все пустые поля будут удалены<br> />Обратите внимание, что этот параметр использует метод обновления OpenCart по умолчанию, поэтому, если у вас есть какие-либо пользовательские операции по добавлению модулей при обновлении элемента, они все равно будут работать в этом режиме</td></tr>
   <tr><td><b>Пропустить</b></td><td>Элемент существует, но не обновляйте его. Может быть полезно, если вы хотите создавать только новые элементы</td></tr>
   <tr><td><b>Добавить параметр</b></td><td>Для импорта параметров продукта просто добавьте параметр к элементу, больше ничего не меняйте</td></tr>
   <tr><td><b>Сначала обновить, затем добавить параметр.</b></td><td>То же, что и предыдущий, за исключением того, что первый найденный элемент обновит элемент, а в следующих строках будет добавлен параметр.</td>< /тр>
</table>
';
$_['info_csv_settings_title'] = 'Настройки CSV';
$_['info_csv_settings'] = '<h4>Настройки CSV</h4>
<p>Особые параметры импорта CSV.</p>
<h5>Разделитель полей CSV</h5>
<p>Выберите символ-разделитель полей в вашем CSV-файле. Если вы установили его неправильно, на шаге 3 вы увидите, что все данные находятся в одном столбце, в этом случае просто вернитесь и установите правильный разделитель.</p> р>
<h5>Поле CSV</h5>
<p>Выберите символ вложения вашего CSV-файла — он окружает текст каждой ячейки.</p>
<h5>Кодировка символов</h5>
<p>Если ваши данные отображаются неправильно, попробуйте установить здесь правильную кодировку символов. Если вы не знаете, что это такое, попробуйте сначала использовать автоматическое определение или общие кодировки.</p>
<h5>Первая строка — заголовок</h5>
<p>Если первая строка вашего CSV-файла содержит имена столбцов, установите для нее значение «да».</p>
<h5>Разделитель нескольких значений</h5>
<p>Если у вас есть поля, которые могут содержать несколько значений, вы можете установить здесь символ-разделитель. Это будет символ по умолчанию для файла, но если у вас разные разделители, вы также можете установить определенный символ для поля. на шаге 3 &gt; Дополнительные функции</p>
';
$_['info_xls_settings_title'] = 'Настройки Excel';
$_['info_xls_settings'] = '<h4>Настройки Excel</h4>
<p>Особые параметры импорта Excel.</p>
<h5>Рабочий лист</h5>
<p>Если у вас есть данные на нескольких листах Excel, вы можете использовать этот параметр, чтобы выбрать, на каком из них вы хотите получить свои данные, по умолчанию выбирается первый лист.</p>
<h5>Первая строка — заголовок</h5>
<p>Если первая строка вашего файла содержит имена столбцов, установите для нее значение «да».</p>
<h5>Разделитель нескольких значений</h5>
<p>Если у вас есть поля, которые могут содержать несколько значений, вы можете указать здесь символ-разделитель. Это будет символ по умолчанию для файла, но если у вас разные разделители, вы также можете установить определенный символ для поля. на шаге 3 &gt; Дополнительные функции</p>
';
$_['info_xml_settings_title'] = 'Настройки XML';
$_['info_xml_settings'] = '<h4>Настройки XML</h4>
<h5>Кодировка символов</h5>
<p>Если ваши данные отображаются неправильно, попробуйте установить здесь правильную кодировку символов. Если вы не знаете, что это такое, попробуйте сначала использовать автоматическое определение или общие кодировки.</p>
<h5>Узел элемента XML</h5>
<p>Здесь вы должны указать имя узла XML, содержащего ваши данные, например, если у вас есть такие данные:</p>
<p><pre style="white-space:pre">&lt;products&gt;
   &lt;<b>продукт</b>&gt;
     &lt;name&gt;Azerty Keyboard&lt;/name&gt;
     &lt;цена&gt;39&lt;/цена&gt;
     [...]
   &lt;/<b>продукт</b>&gt;
&lt;/продукты&gt;
</pre></p>
<p>Тогда узлом элемента является <b>продукт</b>.</p>
<p>Модуль попытается автоматически обнаружить его, так что, как правило, все в порядке, но если он не работает, проверьте свой файл, чтобы установить правильное имя узла.</p>
';

// Error
$_['warning_incorrect_image_format'] = 'Неверный формат изображения:';
$_['error_curl'] = 'При попытке загрузки файла произошла ошибка, возможно, файл не существует или запрещен доступ к серверу.<br/>Подробнее: <b>%s</b><br />URL: <b>%s</b>';
$_['error_curl_api'] = 'При попытке подключения к API произошла ошибка, возможно, из-за неправильного URL-адреса или запрета доступа к серверу. Обязательно используйте правильный URL-адрес и логин.<br/>Подробнее: <b> %s</b><br/>URL: <b>%s</b>';
$_['error_extension'] = 'Тип файла не найден или несовместим для импорта: <b>%s</b>, разрешенные типы импорта: csv, xml, xls, xlsx, json, txt, tsv , оч. Попробуйте принудительно расширить файл.';
$_['error_zip_file_not_found'] = 'Файл в zip-архиве не найден. Убедитесь, что имя архива соответствует точному имени файла + расширение .zip, например my_feed.csv.zip с внутренним файлом с именем my_feed.csv<br/ >Текущее ожидаемое имя файла: <b>%s</b>';
$_['error_file_not_found'] = 'Внимание: файл не может быть открыт, проверьте правильность пути';
$_['error_ftp_login_incorrect'] = 'Внимание: невозможно подключиться к FTP с текущим паролем имени пользователя';
$_['error_ftp_copy_failed'] = 'Ошибка: невозможно загрузить ftp-файл, ftp-соединение в порядке, файл существует, но загрузка не удалась. Свяжитесь с вашим хостером и попросите его проверить, почему ftp_get() не работает на вашем веб-сайте';
$_['error_api_no_data'] = 'Внимание: в <b>%s</b> не найдено данных, убедитесь, что указан правильный путь.';
$_['error_xml_no_data'] = 'Внимание: данные для данного узла xml не найдены, убедитесь, что вы правильно установили имя узла, содержащего ваш набор данных';
$_['error_permission'] = 'Внимание: у вас нет разрешения на изменение этого модуля!';
$_['error_permission_demo'] = 'Демо-режим, сохранение не разрешено';
$_['warning_demo_file_limitation'] = 'Демо-режим: разрешена только загрузка файлов или демонстрационные файлы, а размер файла ограничен 2 МБ';