<?php
// Heading
$_['heading_title_1']  = 'Розширена гарантія';
$_['heading_title_2']  = 'апаратного та програмного забезпечення';

// Text
$_['text_1']     = 'Консультації по встановленню та налагодженню';
$_['text_2']     = 'Консультації по функціональним можливостям';
$_['text_3']     = 'Аналіз існуючої програмно-апаратної інфраструктури замовника з метою визначення оптимальної стратегії впровадження нових рішень';
$_['text_4']     = 'Закріплення персонального сертифікованого фахівця';
$_['text_5']     = 'Надання нових версій ПЗ: <ul> <li>установка (на вимогу) <li>установка (оповіщення за датою виходу) </li></ul>';
$_['text_6']     = 'Виявлення дефектів в обладнанні або в ПЗ і консультація по установці:<ul> <li> з підключенням по віддаленому доступу</li></ul>';
$_['text_7']     = 'Виїзд фахівця на об`єкт';
$_['text_8']     = 'Навчання співробітників по работі з обладнанням або програмним забезпеченням';
$_['text_9']     = 'Підключення представників виробника з послугами перекладача';
$_['text_10']    = 'Можливість впровадження персональних змін в прошивку обладнання, із залученням представників виробника';
$_['text_11']    = 'Швидкість реагування на звернення в робочі дні';
$_['text_12']    = 'Заміна RMA обладнання після діагностики фахівцем протягом';
$_['text_13']    = 'Підмінний фонд обладнання протягом';
$_['text_hours']    = 'годин';
$_['text_hour']    = 'години';
$_['text_days']    = 'днів';
$_['text_day']    = 'день';
$_['text_month']    = 'міс.';
$_['button_contact']    = 'Зв\'язатися з нами';


