<?php
// Heading
$_['heading_title_1']  = 'Расширенная гарантия';
$_['heading_title_2']  = 'апаратного и програмного обеспечения';

// Text
$_['text_1']     = 'Консультации по установке и настройке';
$_['text_2']     = 'Консультации по функциональным возможностям';
$_['text_3']     = 'Анализ существующей программно-апаратной инфраструктуры заказчика с целью определения оптимальной стратегии внедрения новых решений';
$_['text_4']     = 'Закрепление персонального сертифицированного специалиста';
$_['text_5']     = 'Предоставление новых версий ПО: <ul> <li>установка(по требованию)</li> <li>установка(оповещение по дате выхода)</li></ul>';
$_['text_6']     = 'Выявление дефектов в оборудовании или в ПО и консультация по установке: <ul><li>с подключением по удаленному доступу</li></ul>';
$_['text_7']     = 'Выезд специалиста на объект';
$_['text_8']     = 'Обучение сотрудников по работе с оборудованием или программным обеспечением';
$_['text_9']     = 'Подключение представителей производителя с услугами переводчика';
$_['text_10']    = 'Возможность внедрения персональных изменений в прошивку оборудования, с привлечением представителей производителя';
$_['text_11']    = 'Скорость реагирования на обращение в рабочие дни';
$_['text_12']    = 'Замена RMA оборудования после диагностики специалистом в течении';
$_['text_13']    = 'Подменный фонд оборудования в течении';
$_['button_contact']    = 'Связаться с нами';
$_['text_hours']    = 'часов';
$_['text_hour']    = 'часа';
$_['text_days']    = 'дней';
$_['text_day']    = 'день';
$_['text_month']    = 'мес.';





